[
    {
        "id": 1,
        "title": "Multiscale || Coupled || General",
        "description": "Multiscale coupled systems are ubiquitous in sciences, engineering, and society. All phenomena we observe in Nature are reflections of various forms couplings, e.g. between different physical fields, between different components of a system, or between different systems.",
        "link": null,
        "body": "<p class=\"ql-align-justify\">Multiscale coupled systems are ubiquitous in sciences, engineering, and society. All phenomena we observe in Nature are reflections of various forms couplings, e.g. between different physical fields, between different components of a system, or between different systems. A key to our better understanding of such multiscale coupled systems, effects, and phenomena is kept in their rigorous mathematical description. At the same time, due to coupling and multiscale characteristics of these systems, effects, and phenomena, such a description, consisting in the development of adequate mathematical models and methodologies for their solutions, leads to some of the most challenging problems of modern science &amp; engineering. This group of projects have been dealing with&nbsp;the analysis and applications of <span style=\"color: windowtext;\">m</span>ultiscale coupled systems and phenomena.</p><p class=\"ql-align-justify\"><span style=\"color: black;\">In this group, our research interests have included, but not limited to, the following research projects: </span></p>",
        "created_at": "2020-05-24T02:00:14.954Z",
        "updated_at": "2020-07-29T05:20:39.221Z",
        "featured": true,
        "sidebar": true,
        "order": "1",
        "pIndex": "1",
        "keywords": "Coupled fields theory, Waves in complex media, Coupled models in Molecular Dynamics and First Principles calculations, Conservative numerical schemes and variational difference approaches\n\n",
        "sideOrder": "1",
        "img": "/upload/S7.png",
        "subprojects": [
            {
                "id": 1,
                "title": "Coupled fields theory and its applications: electro-mechanical fields, thermo-elasticity, thermo-electricity, thermo-electroelasticity, magneto-thermo-electroelasticity;",
                "description": "",
                "link": null,
                "body": "<p class=\"ql-align-justify\">Some of the most important and challenging problems in science and engineering are coupled problems. The coupling is pronounced at three basic levels: </p><ol><li class=\"ql-align-justify\">The level of field coupling as it is the case in thermo-elasticity, electro-elasticity and in many other areas of applications</li><li class=\"ql-align-justify\">The level of coupled effects between different parts of the system, and/or</li><li class=\"ql-align-justify\">The level of coupling between different spatial/spatio-temporal scales at which the natural or man-made system, that is being studied, operates. </li></ol><p class=\"ql-align-justify\">This coupling brings to life new phenomena, the phenomena which are not amenable to an adequate description with conventional mathematical models, traditionally developed without accounting for the coupled nature of the problem. An early observation that the coupling in nature plays a profound role was made by Aristotle who noted that \"the whole is more than the sum of its parts.\" The development of coupled mathematical models has an interesting history with one of the first examples attributed to Pierre Simon Laplace who corrected Newton's purely mechanical theory of sound propagation by accounting for thermal field effects. Another important example includes the development of a dynamic model of coupled electro-magnetic interactions by James Clerk Maxwell. At the M3AI® Lab, we focus on the development of coupled mathematical models for addressing fundamental questions of science and solving new problems in science and engineering. We study coupled phenomena, effects, and processes that are becoming increasingly important in the areas of nano- and bio-nano technologies, in new technologies based on smart materials and structures, biocompatible materials and bio-inspired systems, and in other areas.</p><p class=\"ql-align-justify\"><br></p><ul><li class=\"ql-align-justify\"><strong><u>Dynamic Thermoelasticity (linear and nonlinear models)</u></strong></li><li class=\"ql-indent-1 ql-align-justify\"><strong><u>﻿</u></strong>As noted, early attempts of creating a theory that would describe mechanical and thermal fields as a unified process go back to P. S. Laplace with his&nbsp;ideas of correcting Newton's purely mechanical theory of sound propagation.&nbsp;However, it is only with the advent of the applications where thermal stresses were becoming increasingly important, the dynamic theory of thermoelasticity was put firmly on the map of research in mathematics and mechanics. In particular, an important modern precursor for the development of coupled dynamic thermoelasticity was laid down by the works of V. I. Danilovskaya who studied thermal stress waves generated by boundary in the early 1950-ies. Most of the works in the field were related to the standard displacement-temperature formulation. We noted that in many applied problems it is the stress components, along with the temperature, are the main unknowns to be determined. As a result, we proposed to solve the problem of coupled dynamic thermoelasticity in the stress-temperature formulation [&nbsp;<span style=\"background-color: rgb(255, 255, 255);\">EJ-8</span>&nbsp;,&nbsp;<span style=\"background-color: rgb(255, 255, 255);\">EJ-17</span>&nbsp;,&nbsp;<span style=\"background-color: rgb(255, 255, 255);\">EJ-41</span>&nbsp;]. Based on the Steklov's operator technique combined with the application of the Bramble-Hilbert lemma, we obtained a priori estimates that were dependent on the solution regularity. A general family of operator-difference schemes for the solution of the underlying problems was derived and convergence of such schemes was analyzed in classes of generalized (weak) solutions. Furthermore, a detailed dispersion analysis for such fully coupled problems was carried out and it was shown that the stability conditions for derived schemes can be obtained with the Cayley transform technique [&nbsp;<span style=\"background-color: rgb(255, 255, 255);\">EJ-41</span>&nbsp;].</li><li class=\"ql-indent-1 ql-align-justify\">We have also been contributing to nonlinear coupled dynamic thermoelasticity. Our main interests here were centered around problems describing multiphase solids such as materials with shape memory and phase transformations. In particular, in order to describe low (martensite) and high (austenite) temperature phases in such materials simultaneously and transformations between these phases, we were using the Landau-Devonshire-Ginzbrurg representation of the free energy function, leading to a quintic nonlinearity in the stress-strain constitutive models. Due to this high order nonlinearity and intrinsic coupling between the equations, the resulting problems are at the forefront of challenges in modern applied and computational mathematics. Our works in this field can be divided into a few groups, (A) to (D).</li><li class=\"ql-indent-2 ql-align-justify\"><strong><u>(A) - Model Reduction</u>: </strong>We were interested in the analysis of general three-dimensional (3D) models describing phase transformations, focusing on the development efficient procedures for model reductions. We were the first to propose a reduction of the full 3D PDE-based models for materials with shape memory to a more tractable differential-algebraic systems [&nbsp;<span style=\"background-color: rgb(255, 255, 255);\">EJ-33</span>&nbsp;] (further discussed and exemplified in [<span style=\"background-color: rgb(255, 255, 255);\">EJ-93</span>&nbsp;] for both uncoupled and coupled problems, with additional examples for SMA patches given in [&nbsp;<span style=\"background-color: rgb(255, 255, 255);\">EJ-86</span>&nbsp;]). This original procedure was based on the center manifold theory. This followed immediately by applications of the reduced model where we were able to treat both stress-induced and temperature-induced phase transformations in these materials and related hysteresis phenomena in a unified manner [&nbsp;<span style=\"background-color: rgb(255, 255, 255);\">EJ-44</span>&nbsp;]. A generalization of the original model and to include hyperbolic heat conduction effects was also obtained and discussed in [&nbsp;<span style=\"background-color: rgb(255, 255, 255);\">EJ-49</span>&nbsp;]. This generalized model can be also treated with the developed model reduction technique in a straightforward manner. Details of the developed theory for center-manifold-based model reduction of general 3D models for phase transformation in the context of materials with memory were provided in [&nbsp;<span style=\"background-color: rgb(255, 255, 255);\">EJ-55</span>&nbsp;]. Our model reduction procedures based on the Proper Orthogonal Decomposition (POD) and the Galerkin projection techniques can be found in [&nbsp;<span style=\"background-color: rgb(255, 255, 255);\">EJ-106</span>&nbsp;,&nbsp;<span style=\"background-color: rgb(255, 255, 255);\">EJ-141</span>&nbsp;].</li><li class=\"ql-indent-2\"><strong><u>(B) - Development of Efficient Numerical Methods</u>:&nbsp;</strong>For the first time, conservative numerical approximations in this field of dynamic problems were developed and justified mathematically in [&nbsp;<span style=\"background-color: rgb(255, 255, 255);\">EJ-53</span>&nbsp;,&nbsp;<span style=\"background-color: rgb(255, 255, 255);\">EJ-72</span>&nbsp;]. Chebyshev's collocation and Chebyshev's spectral procedures were developed for these problems in [&nbsp;<span style=\"background-color: rgb(255, 255, 255);\">EJ-100</span>&nbsp;,&nbsp;<span style=\"background-color: rgb(255, 255, 255);\">EJ-107</span>&nbsp;] (also proceedings [ Cruz-2009 ]) which also included the Rayleigh dissipation term [&nbsp;<span style=\"background-color: rgb(255, 255, 255);\">EJ-111</span>&nbsp;]. We developed a Finite Element Method (FEM) based approach that incorporates the lattice kinetics, involving the order variables, and non-equilibrium thermodynamics [&nbsp;<span style=\"background-color: rgb(255, 255, 255);\">EJ-114</span>&nbsp;]. Its variants, including those applied to 3D problems, were discussed in detail in [&nbsp;<span style=\"background-color: rgb(255, 255, 255);\">EJ-82</span>&nbsp;,&nbsp;<span style=\"background-color: rgb(255, 255, 255);\">EJ-92</span>&nbsp;,&nbsp;<span style=\"background-color: rgb(255, 255, 255);\">EJ-104</span>&nbsp;] and our new Finite Volume Method procedure for these dynamic problems was reported in [&nbsp;<span style=\"background-color: rgb(255, 255, 255);\">EJ-101</span>&nbsp;].</li><li class=\"ql-indent-2\"><strong><u>(C) - Applications</u>:</strong>&nbsp;The development of models and their efficient numerical solutions in this field having in mind specific physical or engineering systems has been an important part of our research too. Materials with shape memory have applications from aerospace engineering to biomechanics and from medical practices to low dimensional nanostructures. We discussed several applications of these materials in engineering and industrial contexts, where they often have to be treated as multiscale coupled dynamic problems [&nbsp;<span style=\"background-color: rgb(255, 255, 255);\">EJ-74</span>&nbsp;], in [&nbsp;<span style=\"background-color: rgb(255, 255, 255);\">EJ-42</span>&nbsp;,&nbsp;<span style=\"background-color: rgb(255, 255, 255);\">EJ-69</span>&nbsp;,<span style=\"background-color: rgb(255, 255, 255);\">&nbsp;EJ-91</span>&nbsp;,<span style=\"background-color: rgb(255, 255, 255);\">&nbsp;EJ-92</span>&nbsp;,&nbsp;<span style=\"background-color: rgb(255, 255, 255);\">EJ-100</span>&nbsp;,&nbsp;<span style=\"background-color: rgb(255, 255, 255);\">EJ-107</span>&nbsp;,&nbsp;<span style=\"background-color: rgb(255, 255, 255);\">EJ-111&nbsp;</span>,&nbsp;<span style=\"background-color: rgb(255, 255, 255);\">EJ-114</span>&nbsp;,&nbsp;<span style=\"background-color: rgb(255, 255, 255);\">EJ-117</span>]. More on biological and medical applications of materials with memory can be found&nbsp;<span style=\"background-color: rgb(255, 255, 255);\">here</span>.</li><li class=\"ql-indent-2\"><strong><u>(D) - Optimization and Control</u>: </strong>A new hybrid optimization procedure for the models describing phase transformations in materials with memory was developed and applied in [&nbsp;<span style=\"background-color: rgb(255, 255, 255);\">EJ-118</span>&nbsp;]. The methodology proposed was based on an initial estimate of the global solution by a genetic algorithm, followed by a refined quasi-Newton procedure to locally refine the optimum. By combining the local and global search algorithms, the developed optimization procedure was demonstrated on several examples. To control such multiphase complex systems as materials with shape memory is a difficult task. This task was undertaken in our paper [&nbsp;<span style=\"background-color: rgb(255, 255, 255);\">EJ-132</span>&nbsp;] in a closely related context of ferroelectric materials. Theoretical issues of complex systems control were discussed in [&nbsp;<span style=\"background-color: rgb(255, 255, 255);\">EJ-21</span>&nbsp;,&nbsp;<span style=\"background-color: rgb(255, 255, 255);\">EJ-60</span>&nbsp;,&nbsp;<span style=\"background-color: rgb(255, 255, 255);\">EJ-129</span>&nbsp;].</li><li class=\"ql-indent-2\">Most recent applications of coupling between thermal and elastic fields have been explored by us in the context of low dimensional nanostructures [&nbsp;<span style=\"background-color: rgb(255, 255, 255);\">EJ-135</span>&nbsp;,&nbsp;<span style=\"background-color: rgb(255, 255, 255);\">EJ-138&nbsp;</span>].</li><li><strong><u>Dynamic Electroelasticity and Electromechanical Fields (piezoelectric effects, linear and nonlinear models)</u></strong></li><li class=\"ql-indent-1\">Practical applications of electroelasticity theory started at least from the discovery&nbsp;in 1880 by the brothers Pierre and Jacques Curie the direct piezoelectric effect, followed a year later by the works of Gabriel Lippmann on the converse piezoelectric effect. This effect is pronounced by the ability of certain materials to generate an electric field in response to applied mechanical strain. The applicability of such materials is surprisingly large, including a multitude of physical and engineering systems (where crystals, certain ceramics, or piezoelectric polymers are in the heart of their functioning), as well as biological systems, ranging from bones and biological tissues to DNA and proteins.</li><li class=\"ql-indent-1\">The original development of mathematical models in the field of piezoelectricity is largely due to Woldemar Voight and his book on crystal physics published in 1910. Despite many applications of dynamic theory of piezoelectricity, the well-posedness and regularity of solutions of underlying mathematical equations remained open until the late 1980ies. We were the first who succeeded to provide a rigorous mathematical proof of such coupled dynamic models' well-posedness and who analyzed the regularity of their solutions [&nbsp;EJ-3&nbsp;,&nbsp;EJ-5&nbsp;,&nbsp;EJ-7&nbsp;]. The main summary of the results are given in [&nbsp;EJ-11&nbsp;,&nbsp;EJ-22&nbsp;,&nbsp;EJ-24&nbsp;] and [&nbsp;EJ-31&nbsp;] for one- and multi-dimensional cases, respectively. Efficient variational-difference numerical approximations were also developed at that time with a hierarchy of a priori estimates dependent of the regularity of the underlying solution [&nbsp;EJ-1&nbsp;,&nbsp;EJ-2&nbsp;,&nbsp;EJ-6&nbsp;,&nbsp;EJ-13&nbsp;,&nbsp;EJ-19&nbsp;]. Those early results were the basis for the development a family of variational-difference schemes for the solution of coupled dynamic problems of electroelasticity describing piezoelectric phenomena, a generalization of the Courant-Friedrichs-Lewy stability condition to the case of coupled electroelasticity, obtained by us for the first time, as well as for obtaining&nbsp;a scale of accuracy results for generalized solutions of such problems and convergence theorems [&nbsp;EJ-22&nbsp;,&nbsp;EJ-24&nbsp;,&nbsp;EJ-26&nbsp;,&nbsp;EJ-29&nbsp;,&nbsp;EJ-31&nbsp;,&nbsp;EJ-71&nbsp;] . This provided a rigorous mathematical justification for the application of dynamic models coupling electric and mechanical fields and capable of describing piezoelectric phenomena.</li><li class=\"ql-indent-1\">As a result, our later works in this field were focused on the application of such models to important problems in the analysis and modelling of biological systems (e.g., [&nbsp;EJ-99&nbsp;]), as well as of low dimensional nanostructures such as quantum nanowires, dots, carbon nanotubes (e.g., [&nbsp;EJ-90&nbsp;,&nbsp;EJ-116&nbsp;,&nbsp;EJ-135&nbsp;,&nbsp;EJ-136&nbsp;,&nbsp;EJ-138&nbsp;,&nbsp;EJ-146&nbsp;]), where coupled electromechanical fields are of crucial importance.</li><li><strong>Thermoelectricity</strong></li><li class=\"ql-indent-1\">The essence of thermoelctricity is a coupling between temperature differences and electric voltage. There are several important effects where thermoelectricity plays a key role, namely the&nbsp;Seebeck,&nbsp;the&nbsp;Peltier effect, and the&nbsp;Thomson effects. These thermoelectric effects have a wide range of applications starting from their traditional cooling applications to their applications in nanotechnology. Our original interest in thermoelectricity was due to modelling issues of SMA actuators&nbsp;[&nbsp;<span style=\"background-color: rgb(255, 255, 255);\">EJ-42</span>&nbsp;]. Many problems arising in this context lead to multiscale coupled dynamic models [&nbsp;<span style=\"background-color: rgb(255, 255, 255);\">EJ-74</span>&nbsp;] and we have continuing interest in developing efficient numerical methods for dealing with such models. In particular, our current interest in the topic is due to the importance of thermoelectricity in modelling low dimensional nanostructures [&nbsp;<span style=\"background-color: rgb(255, 255, 255);\">EJ-135</span>&nbsp;,&nbsp;<span style=\"background-color: rgb(255, 255, 255);\">EJ-138</span>&nbsp;].</li><li><strong><u>Ferroelectricity and Flexoelectricity</u></strong></li><li class=\"ql-indent-1\">In many materials we observe a spontaneous electric polarization that can be reversed by the application of an external electric field. This phenomenon is known as ferroelectricity. To study this phenomenon is difficult due to the fact that its characteristics are dependent on a range of different factors, including dimensions of the material sample, temperature, surface effects and boundary conditions, etc. Landau theory provides a foundation upon which the mathematical modelling of ferroelectric materials is based. Corresponding (thermodynamic) mathematical models, derived from the expansion of the free energy function, serve as a bridge between microscopic and macroscopic modelling frameworks. Due to contributions of Devonshire specifically in the context of ferroelectric and Ginzburg in the context of finite size ferroelectrics, the resulting models are usually termed as the models of Landau-Devonshire-Ginzburg type. It is these models that represent our main interest in this field.</li><li class=\"ql-indent-1\">Ferroelectricity is becoming increasingly important at the nanoscale due to its size dependence. We are interested in this and other similar effects at the nanoscale such as flexoelectricity where the material may exhibit a spontaneous electrical polarization induced by a strain gradient. In fact, recent studies show that low dimensional nanostructures may exhibit nonlocal electromechanical effects such as&nbsp;flexoelectricity. At the same time, despite the recent progress in nanostructure growth techniques imperfections such as defects are practically unavoidable. These imperfections may enhance flexoelectric effects. We analyzed the effects of these imperfections on linear electromechanical properties and on&nbsp;flexoelectricity, focusing on the study of GaN-based quantum dots embedded in an AlN matrix [&nbsp;EP-79&nbsp;].</li><li><strong><u>Coupled Dynamic Thermo-electroelasticity, Magneto-thermo-electroelasticity, Other Coupled Effects</u></strong></li><li class=\"ql-indent-1\">Mathematical models of thermo-electroelasticity and numerical methods for their solutions were studied in [&nbsp;EJ-39&nbsp;,&nbsp;EJ-56&nbsp;]. The interactions of piezoelectric structures with fluid media as a representative example of fluid-structure interaction problems were studied by us in [&nbsp;EJ-85&nbsp;]. On a closely related note we have also been interested in interactions of electromechanical fields with acoustic media. Such problems are important in many applications in the classical mechanics setting [&nbsp;EJ-50&nbsp;], as well as in the context of modelling opto-electronic media [&nbsp;EJ-14&nbsp;] where quantum effects may become important. The latter is of interest to us in the context of low dimensional semiconductor nanostructures where we also analyzed systematically the influence of thermo-electromechanical fields on the properties of such structures [&nbsp;EJ-135&nbsp;,&nbsp;EJ-138&nbsp;], as well as the influence of the magnetic field as a control parameter [&nbsp;EJ-146&nbsp;].</li></ul><p><br></p>",
                "pIndex": "1",
                "keywords": "",
                "project": 1,
                "created_at": "2020-06-08T02:48:45.429Z",
                "updated_at": "2020-11-11T03:02:08.913Z",
                "publications": [
                    179,
                    97,
                    193,
                    350,
                    209,
                    298,
                    270,
                    225,
                    109,
                    104,
                    279,
                    226,
                    191,
                    199,
                    98,
                    217,
                    297,
                    277,
                    175,
                    306,
                    107,
                    148,
                    249,
                    133,
                    172,
                    177,
                    239,
                    213,
                    77,
                    141,
                    182,
                    143,
                    247,
                    180,
                    285,
                    276,
                    235,
                    214,
                    130,
                    101,
                    129,
                    117,
                    288,
                    271,
                    137,
                    240,
                    103,
                    136,
                    227,
                    115,
                    292,
                    291,
                    116,
                    299,
                    196,
                    186,
                    112,
                    300,
                    139
                ]
            },
            {
                "id": 2,
                "title": "Waves in complex media, highly oscillatory phenomena, coupling continuum and quantum worlds;",
                "description": "",
                "link": null,
                "body": "<p>We are interested waves in microstructures and associated multiscale phenomena. This interest has been largely motivated, but not limited to, the analysis of microstructures in multiphase materials such as materials with shape memory, described in detail in&nbsp;the previous section.</p><p><br></p><p>Other topics of interest here include wave phenomena in polymers and composites (e.g., thermal spiking [&nbsp;EJ-45&nbsp;,&nbsp;EJ-59]), in layered media [&nbsp;EJ-18&nbsp;] (e.g.,&nbsp;semiconductor-piezoelectric layers [&nbsp;EJ-14&nbsp;] and nanolayers [&nbsp;EP-82&nbsp;]),&nbsp;in DNA related processes [&nbsp;EJ-105&nbsp;,&nbsp;EJ-109&nbsp;,&nbsp;EJ-126&nbsp;], and other physical, biological, and engineering systems.</p><p><br></p><p>Many problems in these areas require dealing with highly oscillatory functions and their integration. In addition, in many applications we have to account for the fact that the information about such functions come from experiments and usually is incomplete. Optimal and other efficient formulae for integrating such functions in one- and multi-dimensional cases were derived in a series of our papers [&nbsp;EJ-27&nbsp;,&nbsp;EJ-43&nbsp;,&nbsp;EJ-48&nbsp;,&nbsp;EJ-66&nbsp;]. We are also interested in the spectral analysis of complex systems and associated eigenvalue problems [&nbsp;EJ-34&nbsp;], as well as in fundamental and applied problems on the border between classical and quantum mechanics [&nbsp;EJ-133&nbsp;,&nbsp;EJ-138&nbsp;].</p>",
                "pIndex": "2",
                "keywords": "",
                "project": 1,
                "created_at": "2020-06-08T03:14:46.288Z",
                "updated_at": "2020-11-11T03:06:43.743Z",
                "publications": [
                    354,
                    201,
                    246,
                    106,
                    264,
                    187,
                    219,
                    134,
                    215,
                    102,
                    224,
                    126,
                    141,
                    139,
                    174
                ]
            },
            {
                "id": 3,
                "title": "Coupled models in Molecular Dynamics and First Principles calculations, lattice models, phase transformations and critical phenomena",
                "description": "",
                "link": null,
                "body": "<p>In a subset of coupled multiscale problems we are dealing with, we need to get a more refined insight into some properties of the structures or materials of interest. In this case, we develop Molecular Dynamics and First Principles based methodologies. Examples of our endeavours in this field include Nonequilibrium Molecular Dynamics (NMD) studies of nanowires [&nbsp;EJ-144&nbsp;] and Molecular Dynamics studies of RNA nanostructures [&nbsp;EJ-137&nbsp;] with subsequent development of a hierarchy of models for carrying out systematic coarse-graining of such structures [&nbsp;EJ-145&nbsp;]. First Principles methodologies were applied to our comprehensive studies of aluminum-nickel and calcium compound systems [EJ-134&nbsp;,&nbsp;EJ-140&nbsp;], while our newly developed&nbsp;combined nonequilibrium Green's function and density functional theory methodology was applied to studies of zinc-oxide nanowires [&nbsp;EJ-139&nbsp;] (with nickel-aluminum nanolayers studied by us in [&nbsp;EP-82&nbsp;] and relative stability of nanosized zinc-oxide studied in [&nbsp;EJ-125&nbsp;]).</p><p><br></p><p>High performance computing is also an essential element in our studies of lattice spin models where we focus on the behaviour near the critical (phase transition) point by using non-perturbative approaches based on Monte-Carlo methods [&nbsp;EJ-103&nbsp;,&nbsp;EJ-115&nbsp;,&nbsp;EJ-143&nbsp;]. This includes our analysis of Goldstone singularity in XY models and the Goldstone mode effects in three-dimensional O(4) models. The Wolff cluster algorithm provides one of the most effective tools to simulate important properties of many particle systems near the critical point. However, a major drawback in the application of this algorithm were related to difficulties in its parallelization, in particular in the application to large lattices. On the example of three-dimensional Ising models, in [&nbsp;EJ-142&nbsp;] we demonstrated for the first time how parallelization of the Wolff single cluster algorithm can be achieved. Our procedure is generalizable to other lattice spin models and provides an important new tool for the simulation of very large lattices near the critical phase transition point.</p><p><br></p><p>Phase transformations are universal phenomena occurring frequently in physics and chemistry, biology and medicine, engineering and finance. The procedures developed by us here are potentially useful in other applications ranging from quantum spin problems to financial applications (see also&nbsp;here) and to Barabasi-Albert networks [&nbsp;EJ-142&nbsp;].</p>",
                "pIndex": "3",
                "keywords": "",
                "project": 1,
                "created_at": "2020-06-08T22:49:02.974Z",
                "updated_at": "2020-11-11T03:07:32.085Z",
                "publications": [
                    144,
                    145,
                    138,
                    146,
                    140,
                    147,
                    125,
                    142,
                    135,
                    100,
                    354,
                    114
                ]
            },
            {
                "id": 4,
                "title": "Conservative numerical schemes and variational difference approaches; numerical analysis; model reductions; well-posedness and regularities of coupled PDEs",
                "description": "",
                "link": null,
                "body": "<p>Our results in this area pertain to coupled systems of PDEs, including hyperbolic-parabolic and hyperbolic-elliptic systems. The former arise, for example, in the context of dynamic coupled thermoelasticity and the latter in the context of dynamic coupled electroelasticity. Both these applications have been described in details in&nbsp;<a href=\"http://localhost:3000/research/projects/1\" rel=\"noopener noreferrer\" target=\"_blank\">this section</a>&nbsp;where details of existence and uniqueness theory for these problems were also given (see summary of theoretical results in [&nbsp;EJ-11&nbsp;,&nbsp;EJ-22&nbsp;,&nbsp;EJ-24&nbsp;,&nbsp;EJ-31&nbsp;]). Closely related topics, also described above, include a generalization of the Courant-Friedrichs-Lewy (CFL) stability condition to such coupled time-dependent systems [&nbsp;EJ-71&nbsp;]. In addition to variational-difference numerical approximations developed by us for such coupled dynamic problems, we the first to derive conservative numerical approximations for strongly coupled nonlinear problems of thermoelasticity such as those arising in the context of Landau-Devonshire-Ginzburg models of structural phase transformations [&nbsp;EJ-53&nbsp;,&nbsp;EJ-72&nbsp;]. Other methods we developed in this context include Finite Volume Methods (FVM), Finite Element Methods (FEM), and pseudospectral procedures (see details&nbsp;here).</p><p><br></p><p>The development of model reduction procedures for coupled nonlinear dynamic problems described by systems of PDEs is another area of interest. Our earlier contributions were in the development of model reductions based on center manifold, Galerkin projection, and Proper Orthogonal Decomposition (POD) techniques [&nbsp;EJ-33&nbsp;,&nbsp;EJ-49&nbsp;,&nbsp;EJ-106&nbsp;,&nbsp;EJ-141&nbsp;].</p>",
                "pIndex": "4",
                "keywords": "",
                "project": 1,
                "created_at": "2020-06-08T22:49:16.984Z",
                "updated_at": "2020-11-11T03:08:38.047Z",
                "publications": [
                    103,
                    225,
                    182,
                    277,
                    180,
                    199,
                    276,
                    235,
                    143,
                    196,
                    107
                ]
            },
            {
                "id": 5,
                "title": " Dynamics, relaxation time approximations, hyperbolic corrections of parabolic models, extended thermodynamics;",
                "description": "",
                "link": null,
                "body": "<p>We are interested in transport phenomena and dynamic systems that are far from their equilibrium states. Mathematical models in this field can be classified on the basis of relaxation time approximations which in the context of semiconductor modelling of sub-micron structures were applied in&nbsp;[&nbsp;EJ-20&nbsp;,&nbsp;EJ-30&nbsp;,&nbsp;EJ-32&nbsp;,&nbsp;EJ-37&nbsp;,&nbsp;EJ-51&nbsp;,&nbsp;EJ-70&nbsp;]. Theoretical foundations of many such models can be traced to approaches of nonequilibrium thermodynamics. One of such approaches, the extended thermodynamics, has been widely discussed in the literature.</p><p><br></p><p>One of the advantages of the above approach lies in the fact that some non-physical phenomena, such as the infinite speed of heat propagation of the processes based on the Fourier law, can be \"corrected\" within the extended thermodynamics modelling framework. We were analyzing the resulting hyperbolic models in several application areas, including nonlinear models of dynamic coupled thermoelasticity and thermoelastic models for the analysis of polymer dynamics [&nbsp;EJ-28&nbsp;,&nbsp;EJ-33&nbsp;,&nbsp;EJ-40&nbsp;,&nbsp;EJ-49&nbsp;,&nbsp;EJ-78&nbsp;].</p><p>We have also been developing methods based on the Nonequilibrium Molecular Dynamics (NMD) as well as tools based on first principles calculations, nonequilibrium Green's function techniques and density functional theory&nbsp;&nbsp;to study nanostructure properties [EJ-123&nbsp;,&nbsp;EJ-125&nbsp;,&nbsp;EJ-134&nbsp;,&nbsp;EJ-139&nbsp;,&nbsp;EJ-140&nbsp;,&nbsp;EJ-144&nbsp;].</p><p><br></p><p>We are also interested in dynamic problems where the applications of Monte Carlo based procedures can provide an efficient way for their solutions (in the context of&nbsp;phase transformations&nbsp;and&nbsp;financial applications, among others), as well as in modelling complex dynamic biological processes, such as multiscale dynamics of cell cycles [&nbsp;EJ-130&nbsp;].</p>",
                "pIndex": "5",
                "keywords": "",
                "project": 1,
                "created_at": "2020-06-08T22:49:45.592Z",
                "updated_at": "2020-11-11T03:09:57.971Z",
                "publications": [
                    212,
                    283,
                    230,
                    195,
                    125,
                    140,
                    146,
                    225,
                    178,
                    142,
                    135,
                    199,
                    123,
                    274,
                    197,
                    206,
                    131,
                    189
                ]
            },
            {
                "id": 6,
                "title": "Coupled effects in complex systems; interactions of light with matter, fluid/gas and structure interactions;",
                "description": "",
                "link": null,
                "body": "<p>Other coupled problems of interest include&nbsp;interactions of light with matter, e.g. with biological systems such as DNA, human tissues, etc.&nbsp;We developed mathematical models and efficient numerical methods for their solutions for studying the effect of thermal damage induced by ultrashort pulsed lasers [&nbsp;EJ-89&nbsp;,&nbsp;EJ-96&nbsp;,&nbsp;EJ-119&nbsp;]. Apart from applications in physics, chemistry, and engineering, this research is increasingly important in biology and medicine in the context of preventing thermal damage of human tissues. Other mathematical problems of interest related to human health can be found&nbsp;here.</p><p><br></p><p>In addition to biological systems, our interests include also the analysis of multiphase systems and systems with phase transformations under irradiation (ion, UV irradiation, etc). In the context of biological systems recent topics of interests include phototaxis, a movement of an organism in response to the stimulus of light, and the associated hierarchy of mathematical models derived from the Liouville equation for light matter interactions.</p><p>Coupled problems pertinent to fluid-structure interactions and other industrial settings have been discussed in&nbsp;this section.</p>",
                "pIndex": "6",
                "keywords": "",
                "project": 1,
                "created_at": "2020-06-08T22:49:55.493Z",
                "updated_at": "2020-11-11T03:11:34.359Z",
                "publications": [
                    303,
                    295,
                    118
                ]
            },
            {
                "id": 7,
                "title": "Other applications, including physics, biology, engineering, finance, and environmental science.",
                "description": "",
                "link": null,
                "body": "<p>Environmental sciences provide a wide range of coupled dynamic problems. Our interests here include, but not limited to, the development of mathematical models for more precise chemical and biological sensors, as well as for climate systems models and their error analysis. Details of this and other related issues can be found&nbsp;here. Other problems of interests include neural networks and evolutionary based computations in various applications context [&nbsp;EJ-120&nbsp;] (also proceedings [ EP-T-2010]).</p><p><br></p><p>Finally, a wide range of problems we are dealing with require the development of mathematical models for multi-layered, multi-component, or multi-phase structures consisting of several different materials joined together (or components, or phases). While some such problems have already been discussed in&nbsp;the previous section, nanotechnological applications provide a wealth of new challenging problems in this area, from both fundamental and applied perspectives. We are discussing some such problems in the context of low dimensional nanostructures&nbsp;here.</p>",
                "pIndex": "7",
                "keywords": "",
                "project": 1,
                "created_at": "2020-06-08T22:50:09.471Z",
                "updated_at": "2020-11-11T03:12:02.717Z",
                "publications": [
                    120
                ]
            }
        ]
    },
    {
        "id": 2,
        "title": "Life Sciences || Biology || Medicine.",
        "description": "Biology and medicine provide many challenging problems that can be addressed efficiently only with adequately developed mathematical tools. As these disciplines are becoming increasingly quantitative, there is a need in the development of mathematical models for a vast variety of processes and phenomena, most of which have (spatial and/or temporal) multiscale characteristics.",
        "link": null,
        "body": "<p><span style=\"color: rgb(0, 0, 0);\">Biology and medicine provide many challenging problems that can be addressed efficiently only with adequately developed mathematical tools. As these disciplines are becoming increasingly quantitative, there is a need in the development of mathematical models for a vast variety of processes and phenomena, most of which have (spatial and/or temporal) multiscale characteristics. In a number of cases, our interests in this field lie with going down all the way to the building block of life, where we analyze RNA structures at the nanoscale. We develop mathematical models for such building blocks as well as for other biomolecules. Recall that the size of folded RNA structures, for example, is often measured by using the radius of gyration as being on the order of C N&nbsp;</span><sup style=\"color: rgb(0, 0, 0);\">1/3&nbsp;</sup><span style=\"color: rgb(0, 0, 0);\">Å, according to the Flory scaling law, with N being the number of nucleotides and certain constant C. RNA molecules that encode a specific protein product are known as messengers of RNA or mRNA. Although mRNA vary substantially in their size, it is fair to say that most proteins contain at least a hundred amino acid residues and that mRNA must have at least 300 nucleotides on the basis of the triplet code (100 x 3). This gives us certain ideas on the relative size of these molecules. The specific structures we are analyzing are known as RNA nanostructures. These building blocks in their symmetric versions have spatial dimensions lying in the range of 10 - 20 nm. In our research in this focus area we analyze objects from the nanoscale to meso- and to macro- scales. In addition to RNA nanostructures, we are also interested in a number of other areas of mathematical modeling in biology and medicine, including the dynamics of cell cycles, relaxation processes of DNA molecules, biomedical devices with smart materials, biological imaging, drug delivery techniques.﻿</span></p><ul><li>Computational neuroscience and brain research; Models for chronic pain management;</li><li>Biological cells, cellular organelles,and microtubules; coupled and nonlocal effects;</li><li>Biological tissues under thermal ablation, neural and cardiovascular systems; relaxation time effects;</li><li>Mathematical models for drug delivery and other biomedical applications;</li><li>RNA nanostructures; multiple scales in life science and medicine; DNA modeling and dynamics of biomolecules; RNA interference/silencing; cell dynamics;</li><li>Imaging in biology and medicine, the use of quantum dots, carbon nanotubes, bionanotechnology;</li><li>Structurally inhomogeneous systems, biomechanics, bilogical networks.</li></ul>",
        "created_at": "2020-05-25T11:38:36.540Z",
        "updated_at": "2020-07-29T05:15:20.697Z",
        "featured": null,
        "sidebar": true,
        "order": "2",
        "pIndex": "2",
        "keywords": "Computational neuroscience and brain research; Models for chronic pain management; Biological cells, cellular organelles, and microtubules; coupled and nonlocal effects; Biological tissues under thermal ablation, neural and cardiovascular systems; relaxation time effects; Mathematical models for drug delivery and other biomedical applications;",
        "sideOrder": "2",
        "img": "/upload/S2.png",
        "subprojects": [
            {
                "id": 1,
                "title": "Mathematical models for drug delivery and other biomedical applications",
                "description": "",
                "link": null,
                "body": "<p>We are interested in the development of mathematical models for drug delivery, both fluid-based (or aerosole-based) and solid-state-based devices and systems. We analyzed several systems for drug delivery, including the pulmonary-drug-delivery-mode systems based on air-blast atomization which are very important for successful pharmacotherapy. In the heart of such medical systems operation lies the Venturi effect where we observe the reduction in fluid pressure as a result of a fluid flows through a geometrically confined section of a Venturi tube. A conservation-law-based mathematical model was developed and key control parameters, that can allow improvement in the efficiency of the system, were identified [ EJ-47 ]. Main characteristics of the system were analyzed numerically as functions or these parameters.</p><p><br></p><p>Other biomedical and biomechanical applications of interest include the development of mathematical models and efficient numerical methods for their solutions for the usage of smart materials. Materials such as shape memory alloys find a wide range of applications in orthodontics and dental biomechanics , optometry, orthopedic surgery, biologically-friendly replacements in body cavities, arteries and other vascular applications, implants, and in various surgery instruments. While there exists a vast amount of literature on constitutive and time-independent modelling of SMAs and SMA-based systems, our main focus over the years has been of the dynamics. This is quite important feature in biological and medical applications of SMAs. Two key technologies are related to this: smart materials and structures technology and nondestructive evaluation technology. The latter includes the development of non-invasive (or less invasive) medical diagnostics. We first proposed a reduction of the full 3D PDE-based models for materials with shape memory to a more tractable differential-algebraic systems [ EJ-33 ] (further discussed in [EJ-93 ] for both uncoupled and coupled problems). This allowed to treat both stress-induced and temperature-induced phase transformations in these materials and related hysteresis phenomena in a unified manner [ EJ-44 ], with further generalization to include hyperbolicity of heat conduction to follow [ EJ-49 ]. Conservative numerical approximations in this field of dynamic problems were developed and justified mathematically in [ EJ-53 , EJ-72 ]. Chebyshev's collocation and Chebyshev's spectral procedures were developed for these problems in [ EJ-100 , EJ-107 ] (also proceedings [ Cruz-2009 ]) which also included the Rayleigh dissipation term [ EJ-111 ]. A new hybrid optimization procedure was developed and applied in [ EJ-118 ]. We developed a Finite Element Method (FEM) based approach that incorporates the lattice kinetics, involving the order variables, and non-equilibrium thermodynamics [ EJ-114 ]. Its variants, including those applied to 3D problems, were discussed in detail in [ EJ-82 , EJ-92 , EJ-104 ] and our new Finite Volume Method procedure for these dynamic problems was reported in [ EJ-101 ]. We have also developed several efficient procedures for model reductions in this field based on the manifold reduction, the Proper Orthogonal Decomposition (POD), and the Galerkin projection techniques [ EJ-33 , EJ-55 , EJ-106 , EJ-141 ]. More details on our research into the dynamics of SMAs and SMA-based devices can be found here.</p><p><br></p><p>While pulmonary and injection modes of drug delivery have remained their leading positions over the years, it has been recognized that new biological drugs, in particular those based on proteins and nucleic acids that promise to minimize side effects, require new delivery technologies. Indeed, the success of widely discussed RNA and DNA therapies is essentially dependent on such technologies. A key technology to have a revolutionary impact on this field is nanotechnology, a technology that leads a way to the development of efficient nansocale drug delivery techniques. Nanotechnology-based drug carriers have enormous potential in both, the delivery of small molecules and the delivery of such large biomolecules as proteins and nucleic acids to specific targeted areas within the body. Our focus in this area of nanomedicine is on RNA nanostructures as structures that have substantial potential in the development of these new techniques as well as in other areas of biomedical sciences. Nevertheless, very little is known about these structures and our efforts of our group have been directed towards a better understanding of of RNA nanostructure properties [ EJ-137 ]. Several new phenomena have been discovered, including the phenomenon of self-stabilisation of such RNA nanostructures. A hierarchy of new models for systematic studies of such structures have been developed in [ EJ-145 ].</p><p><br></p><p>Other nanostructure-mediated drug delivery methods include quantum dots/shells and carbone nanotubes. You can find more information on various properties of these structures by scrolling down this page and in other sections of this website (in particular, Research Focus Section γ and Research Focus Section ζ).</p>",
                "pIndex": "1",
                "keywords": "",
                "project": 5,
                "created_at": "2020-06-08T22:03:53.633Z",
                "updated_at": "2020-11-11T01:42:20.518Z",
                "publications": [
                    225,
                    138,
                    299,
                    101,
                    103,
                    300,
                    217,
                    235,
                    277,
                    109,
                    97,
                    222,
                    147,
                    98,
                    239,
                    143,
                    112,
                    199,
                    104,
                    117,
                    288
                ]
            },
            {
                "id": 2,
                "title": "RNA nanostructures; multiple scales in life science and medicine; DNA modeling and dynamics of biomolecules; RNA interference/silencing; cell dynamics",
                "description": "",
                "link": null,
                "body": "<p>One of the fundamental components of cells are deoxyribonucleic and ribonucleic nucleic acids (DNA and RNA, respectively). These essential building and functional blocks of life, along with three other main components, proteins, glycans and lipids, consist of molecules which in their turn consist of certain elements. Most of life forms on this planet are made of four basic elements (made of only one type of atom): carbon, hydrogen, nitrogen, and oxygen. DNA, for example, has four nitrogen-containing bases adenine (A), cytosine (C), guanine (G), and thymine (T). DNA molecules form genes found on chromosomes, and genetic frequencies in a population gives us a clue to evolution. It is believed that DNA is transcribed into a messenger RNA (mRNA) which is translated into amino acids. While DNA is a double-stranded biomolecule, RNA is single-stranded such that its messenger (mRNA) carries all instructions from the nucleus to all places where they are needed throughout the cell.</p><p><br></p><p>Our interests here include a range of multiscale problems such as cell dynamics, in particular under the influence of unexpected events or fluctuations [ EJ -130 ], as well as the dynamics of DNA biomolecules where we carried out the analysis of their relaxation under different conditions [ EJ-105 , EJ-109 ]. Several models were constructed for this purpose where an important component was the Smoluchowski equation. In terms of RNA, we are interested in RNA silencing phenomena and technologies associated with them [ EP-67 ], as well as in studying RNA nanostructures where we succeeded to make important steps towards a better understanding of these structures' properties [ EJ-137 , EJ-145 ]. Other problems of interest include mathematical models for RNA-based systems such as nucleic acid sensors and their components (e.g., riboswitches). These problems are part of our larger program in studying complex multiscale dynamics of biological systems and molecular transport via a better understanding of systems behaviour at smaller scales.</p>",
                "pIndex": "2",
                "keywords": "",
                "project": 5,
                "created_at": "2020-07-13T05:02:03.016Z",
                "updated_at": "2020-11-11T01:55:01.063Z",
                "publications": [
                    106,
                    131,
                    102,
                    337,
                    138,
                    147
                ]
            },
            {
                "id": 3,
                "title": "Imaging in biology and medicine, the use of quantum dots, carbon nanotubes, bionanotechnology",
                "description": "",
                "link": null,
                "body": "<p>Quantum dots are at the forefront of many biotechnological innovations. Details of our research into quantum dots properties, new phenomena associated with such properties, and the development of new models for their studies can be found here. When quantum dots are used as biological tags and for bio-imaging, their optical properties are very important as they determine their sensitivity for the analysis of biological objects. Our interest in the applications of quantum dots and other low dimensional nanostructures in bionanotechnology is linked to the development of adequate mathematical modeling support for such applications that would allow a better prediction of these and other properties. As the role of quantum dots in encoding, microscopy in vivo applications, bioimaging, immunofluorescent labeling, and other biological applications is growing, the importance of such support will continue to increase.</p><p><br></p><p>Our interests in this field include also bioconjugated quantum dots and nanosensors based on low dimensional nanostructures. The latter include such examples as quantum dots based nanosensors for DNA detections and plasmonic nanorods/nanotubes for bio-sensing. By now, we studied properties of ZnO nanowires [ EJ-125 , EJ-139 ] which are important as components of promising nanosensors for biodetection and identification. We have also been looking at properties of Carbon Nanotubes (CNTs) based sensors with potential applications in biological sciences, as well as CNTs as an alternative to medical X-ray imaging where we were focusing on field emission properties of these low dimensional nanostructures. We reported the efficiency of the proposed models and techniques based on theoretical, computational, and experimental results [ EJ-112 ,EJ-116 , EJ-122 , EJ-131 ].</p>",
                "pIndex": "3",
                "keywords": "",
                "project": 5,
                "created_at": "2020-07-13T05:02:57.925Z",
                "updated_at": "2020-11-11T01:55:48.787Z",
                "publications": [
                    110,
                    132,
                    140,
                    125,
                    115,
                    122
                ]
            },
            {
                "id": 4,
                "title": "Structurally inhomogeneous systems, biomechanics, biological networks",
                "description": "",
                "link": null,
                "body": "<p>Most biological systems and networks are characterized by structural inhomogeneity and the development of mathematical models and mathematical and computational tools for the analysis of such systems represents a challenge. In this context we are interested in the analysis of bio-polymers, composites, biologically inspired materials with memory, genetic and other biological networks, as well as proteins, DNA, and RNA nanostructures.</p><p><br></p><p>We analyzed the phenomenon of thermal spiking which is important in many areas of applications in medicine, in particular in polymerized materials for artificial joints, orthodontics and dental practices. We developed a new model for this phenomenon, as well as an efficient method for its numerical solution, and presented results on thermal spiking on an example of bone cement [&nbsp;EJ-45&nbsp;,&nbsp;EJ-59&nbsp;]. We showed that mathematically such problems are reducible to a coupled system of ODEs and PDE. Other authors used such mixed coupled models for other biological and medical applications, e.g. in vascular remodelling in biological tissues. The techniques we developed may proved to be quite useful in a number of other areas too. Our other works on polymers and composite materials included the development of efficient algorithms for initial topological optimization of complex polymeric and composite systems [&nbsp;EJ-58&nbsp;], hyperbolic time relaxation models for polymeric materials [&nbsp;EJ-78&nbsp;], relaxation of DNA and the influence of internal viscosity in associated problems [&nbsp;EJ-105&nbsp;,&nbsp;EJ-109&nbsp;,&nbsp;EJ-126&nbsp;].</p><p><br></p><p>Many systems that we have to deal with in this focus areas are characterized by complex dynamic behaviour as well as by coupled multiscale spatial interactions. An important example is provided by nonlinear thermoelasticity which has an increasing range of applications in life sciences in general and in biomechanics in particular. A number of our contributions were devoted to the development of mathematical models and efficient numerical methods for dynamic problems in bio-inspired materials such as shape memory alloys (SMAs). These materials find a wide range of applications in orthodontics and dental biomechanics , optometry, orthopedic surgery, biologically-friendly replacements in body cavities, arteries and other vascular applications, implants, and in various surgery instruments. While there exists a vast amount of literature on constitutive and time-independent modelling of SMAs and SMA-based systems, our main focus over the years has been of the dynamics. This is quite important feature in biological and medical applications of SMAs. Two key technologies are related to this: smart materials and structures technology and nondestructive evaluation technology. The latter includes&nbsp;the development of non-invasive (or less invasive) medical diagnostics.&nbsp;We first proposed a reduction of the full 3D PDE-based models for materials with shape memory to a more tractable differential-algebraic systems [&nbsp;EJ-33&nbsp;] (further discussed in [EJ-93&nbsp;] for both uncoupled and coupled problems). This allowed to treat both stress-induced and temperature-induced phase transformations in these materials and related hysteresis phenomena in a unified manner [&nbsp;EJ-44&nbsp;], with further generalization to include hyperbolicity of heat conduction to follow [&nbsp;EJ-49&nbsp;]. Conservative numerical approximations in this field of dynamic problems were developed and justified mathematically in [&nbsp;EJ-53&nbsp;,&nbsp;EJ-72&nbsp;]. Chebyshev's collocation and Chebyshev's spectral procedures were developed for these problems in [&nbsp;EJ-100&nbsp;,&nbsp;EJ-107&nbsp;] (also proceedings [ Cruz-2009 ]) which also included the Rayleigh dissipation term [&nbsp;EJ-111&nbsp;]. A new hybrid optimization procedure was developed and applied in [&nbsp;EJ-118&nbsp;]. We developed a Finite Element Method (FEM) based approach that incorporates the lattice kinetics, involving the order variables, and non-equilibrium thermodynamics [&nbsp;EJ-114&nbsp;]. Its variants, including those applied to 3D problems, were discussed in detail in [&nbsp;EJ-82&nbsp;,&nbsp;EJ-92&nbsp;,&nbsp;EJ-104&nbsp;] and our new Finite Volume Method procedure for these dynamic problems was reported in [&nbsp;EJ-101&nbsp;]. We have also developed several efficient procedures for model reductions in this field based on the manifold reduction, the Proper Orthogonal Decomposition (POD), and the Galerkin projection techniques [&nbsp;EJ-33&nbsp;,&nbsp;EJ-55&nbsp;,&nbsp;EJ-106&nbsp;,&nbsp;EJ-141&nbsp;]. More details on our research into the dynamics of SMAs and SMA-based devices can be found&nbsp;<a href=\"/research/projects/1\" rel=\"noopener noreferrer\" target=\"_blank\">here</a>.</p><p><br></p><p>Examples of other structurally inhomogeneous biological systems we have been focusing in include also RNA nanostructures [&nbsp;EJ-137&nbsp;,&nbsp;EJ-145&nbsp;] and complex biological networks, dynamics of which has been treated as a multiscale process in the systems biology framework [&nbsp;EJ-37&nbsp;]. Further development of these ideas led to a hierarchy of mathematical models for cell cycle dynamics accounting for stochastic fluctuations [&nbsp;EJ-130&nbsp;]. The multiscale character of evolutionary problems and an intrinsic link between microscopic and macroscopic models for evolution via the concept of perturbed generalized dynamic systems has been discussed in detail in [&nbsp;EJ-120&nbsp;].&nbsp;This concept has other potential applications ranging from control [&nbsp;EJ-21&nbsp;]to the development of evolutionary algorithms in different areas of science, engineering, and even finance [ EP-T-2010], and to the analysis of complex networks.</p><p><br></p><p>Coupled effects are of crucial importance in studying proteins and biological systems that contain proteins. We studied the dynamic collagen piezoelectricity in human cornea including the effect of dehydration. Collagen is a structural protein that is a basic building block of human connective tissues (as well as bones). A constitutive model was proposed for the numerical characterization of cornea based on the available experimental data and a new model was derived based on the conservation law for the dynamic piezoelectricity supplemented by the time-dependent equation for the electromagnetic field [&nbsp;EJ-99&nbsp;]. Numerical results presented here demonstrate promising applications of the developed model in aiding refractive surgery and a better understanding of regenerative processes in cornea.</p>",
                "pIndex": "4",
                "keywords": "",
                "project": 5,
                "created_at": "2020-07-13T05:04:49.207Z",
                "updated_at": "2020-11-11T02:00:36.083Z",
                "publications": [
                    306,
                    206,
                    277,
                    104,
                    103,
                    143,
                    219,
                    283,
                    225,
                    235,
                    288,
                    246,
                    120,
                    109,
                    98,
                    126,
                    199,
                    106,
                    300,
                    299,
                    138,
                    244,
                    112,
                    117,
                    217,
                    147,
                    101,
                    179,
                    239,
                    97,
                    131
                ]
            }
        ]
    },
    {
        "id": 3,
        "title": "Nanoscale Systems || Unification Theories",
        "description": "Our interests here lie primarily with low dimensional nanostructures where the motion of electrons can be confined from one, two, and even three spatial dimensions. The respective structures are known as quantum wells, quantum wires, and quantum dots. Such structures will continue transforming our lives as they will be used as parts of environmental, chemical, and biological sensors, in transportation industries, energy saving technologies, biomedicine, communications, and information technology.",
        "link": null,
        "body": "<p>Our interests here lie primarily with low dimensional nanostructures where the motion of electrons can be confined from one, two, and even three spatial dimensions. The respective structures are known as quantum wells, quantum wires, and quantum dots. Such structures will continue transforming our lives as they will be used as parts of environmental, chemical, and biological sensors, in transportation industries, energy saving technologies, biomedicine, communications, and information technology. In order to successfully use them, we have to know their properties which can be understood better with new mathematical models developed for such nanostructures. The area of mathematical modeling for nanoscience &amp; nanotechnology is dotted with many open problems, some of which we have been addressing. This includes the development of mathematical models for more accurate determinations of properties of such structures, accounting for a range of multiscale effects, originating from the influence of mechanical, electrical, thermal, and other fields. Both classical and quantum mechanical models are required in this development. We have also been working on the formulation of correct boundary conditions for multiscale problems arising from modelling low dimensional nanostructures. Properties at the nanoscale are size dependent, allowing to develop new materials with previously unmatched properties by manipulating their nanostructures. We analyze such properties with state-of-the-art tools that we have been developing based of the Density Functional Theory (DFT), Green's function and nonequilibrium Molecular Dynamics (MD) approaches, to name just a few. In a number of cases, we have to deal with nonlinear problems and several new models that have allowed us to account for new important effects, previously unaccounted for, have also been developed in this context.</p><p><br></p><ul><li>Mathematical models for quantum dots and other low-dimensional structures, quantum information, control, dynamics, coupled problems in quantum mechanics;</li><li>Carbon nanotubes and their arrays in biological imaging and other applications, low-dimensional-nanostructure-based sensors and networks;</li><li>Nonlinear problems and low dimensional nanostructures, inverse problems, properties of materials and new phenomena at the nanoscale;</li><li>Quantum dots as reactive agents, open systems, boundary conditions, foundations of quantum mechanics.</li></ul>",
        "created_at": "2020-07-13T04:34:20.956Z",
        "updated_at": "2020-07-29T05:15:47.370Z",
        "featured": null,
        "sidebar": true,
        "order": null,
        "pIndex": "3",
        "keywords": null,
        "sideOrder": "3",
        "img": "/upload/S3.png",
        "subprojects": [
            {
                "id": 1,
                "title": "Mathematical models for quantum dots and other low-dimensional structures, quantum information, control, dynamics, coupled problems in quantum mechanics",
                "description": "",
                "link": null,
                "body": "<p>We approach the analysis of low dimensional nanostructures as a multiscale, multiphysics problem. We were the first to point out the importance of deriving the correct boundary conditions for the analysis of quantum dots with wetting layers. The underlying problem is a typical multiscale problem, where despite the smallness of the wetting layer as compared to the quantum dot itself, it can influence substantially the electronic processes in the dot. Such boundary conditions were derived and discussed in detail in [&nbsp;EJ-75&nbsp;]. Multiscale systems of quantum dots with wetting layers were analyzed in [&nbsp;EJ-65&nbsp;] for different geometries of quantum dots and the results of band structure calculations were systematically compared (also proceedings [&nbsp;EP-25&nbsp;] where cylindrical quantum dots with wetting layers were analyzed in detail).</p><p><br></p><p>In what follows, we briefly describe our results on the development and applications of mathematical models for the analysis of low dimensional nanostructures, focusing first on quantum dots, rods, nanowires, and nanowire superlattices, and then moving to quantum dot arrays.</p><p><br></p><p>By using the multiband theory, we demonstrated the universality of the phenomenon of inversion, showed its existence for the exited states, and provided a guidelines for the prediction of barrier localization in modulated nanowires. Furthermore, for the first time, on the basis of the multiband theory we demonstrated the existence of critical radii for the inversion of hole states in such nanowires [&nbsp;EJ-61&nbsp;]. This phenomenon should be readily observable in both optical spectroscopy and transport.</p><p><br></p><p>A detailed analysis of the influence of shape, orientation, size and material system on the band structure of quantum wires was carried out in [&nbsp;EJ-62&nbsp;] where we also provided results on comparisons between the classical Luttinger-Kohn Hamiltonian and the Burt-Foreman correction of this Hamiltonian.&nbsp;</p><p><br></p><p>Properties of quantum confinement of symmetric and asymmetric nanowire superlattices (NSL) were studied in [&nbsp;EJ-63&nbsp;] where it was also demonstrated convincingly that asymmetrical NWSL structures have well-pronounced qualitative and quantitative differences as compared to both symmetrical NWSL structures and infinite periodic NWSL structures.&nbsp;The issue of boundary conditions for the analysis of NWSLs in cylindrical polar coordinates have been analyzed in [&nbsp;EJ-67&nbsp;].</p><p><br></p><p>In fact, accounting for symmetries, e.g. cylindrical symmetry, whenever possible is an important direction in the computational analysis of low dimensional nanostructures. In [&nbsp;EJ-80&nbsp;] we presented a new multiband model wurtzite semiconductor nanostructures with cylindrical symmetry. This model extended the Vahala-Sercel formulation to the Rashba-Sheka-Pikus Hamiltonian for wurtzite semiconductors, without the need for the axial approximation. In [&nbsp;EJ-80&nbsp;] we also provided comparisons of our formulation for studying the electronic structure of wurtzite quantum dots with the conventional formulation.</p><p><br></p><p>The influence of aspect ratio on electronic states of quantum rods was analyzed in [&nbsp;EJ-73&nbsp;].&nbsp;We observed that the nonseparability and multiband nature of the problem leads to a complex ground-state envelope function and also to the phenomenon of level crossing. In [&nbsp;EJ-73&nbsp;] we also demonstrated the intrinsic difference between the valence states of a quantum rod and those of a quantum wire.</p><p><br></p><p>When the multiband theory is applied to the analysis of low dimensional nanostructures, in some cases spurious, non-physical solutions may arise. On the example of 8-band model, in [&nbsp;EJ-98&nbsp;] we demonstrated how the spurious solution problem can be resolved. The methodology was applied to studying the electronic properties of InP and InAs free-standing nanowires. We presented band gaps and effective masses as functions of size, shape, and orientation of the nanowires, and compared our results with experimental works and with other calculations.&nbsp;The long-standing problem of spurious solutions in the multiband models has been analyzed in detail in [&nbsp;EJ-133&nbsp;]. We analyzed the resulting mathematical model showed that a failure to restrict the Fourier expansion coefficients of the envelope function to small k components would lead to the appearance of non-physical solutions. We proposed a simple and effective solution to the problem and demonstrated it on an example of a two-band model for both bulk materials and low-dimensional nanostructures. Based on the above requirement of small k, we also derived a model for nanostructures with cylindrical symmetry and applied the developed model to the analysis of quantum dots using an eight-band model.</p><p><br></p><p>We also develop Molecular Dynamics and atomistic based methods for the analysis of nanostructures in those cases when it is necessary. In particular, by using Nonequilibrium Molecular Dynamics (NMD), we explored geometry and temperature dependent properties of materials at different scales, including the analysis of such properties in low dimensional nanostructures. Our interests include structural, thermodynamic, mechanical, transport, and optoelectronic properties, as well as relative and phase stability of materials at the nanoscale. Other tools that we are developing in these studies&nbsp;are based on first principles calculations (applied to nanostructures and intermetallic compounds), nonequilibrium Green's function techniques and density functional theory&nbsp;&nbsp;[EJ-123&nbsp;,&nbsp;EJ-125&nbsp;,&nbsp;EJ-134&nbsp;,&nbsp;EJ-139&nbsp;,&nbsp;EJ-140&nbsp;,&nbsp;EJ-144&nbsp;] .</p><p><br></p><p>Nonlinear effects in low dimensional nanostructures are becoming increasingly important. In [&nbsp;EJ-76&nbsp;] we focused on the influence of nonlinear strain effects and in [&nbsp;EJ-94&nbsp;] on their inclusion in the Hamiltonians for nanostructure modelling. In [&nbsp;EJ-83&nbsp;], we proposed a general method of treating Hamiltonians of deformed nanoscale systems is proposed. This method was used to derive a second-order approximation both for the strong and weak formulations of the eigenvalue problem. The weak formulation was needed in order to allow deformations that have discontinuous first derivatives at interfaces between different materials. It was shown that, as long as the deformation is twice differentiable away from interfaces, the weak formulation is equivalent to the strong formulation with appropriate interface boundary conditions.&nbsp;</p><p><br></p><p>Transport phenomena were in the focus of our analysis of quantum wires where we applied quantum correction type models [&nbsp;EJ-95&nbsp;]. Based on the quantum drift-diffusion model, we analyzed in detail the&nbsp;influence of the metal contact size on the electron dynamics and transport inside such nanowires. We presented in&nbsp;[&nbsp;EJ-95&nbsp;] Current-Voltage (I-V) characteristics for the same heterostructure nanowire supplemented with different combinations of the metal contacts of different sizes. It was demonstrated that the size of the metal contacts strongly influences the carrier dynamics and I-V characteristics of the heterostructure nanowire and that it is possible to produce and tune N-shape of the I-V characteristics by changing the size of the metal contacts.&nbsp;</p><p><br></p><p>A general framework for the nonlinear analysis of low dimensional nanostructures was laid down in [&nbsp;EJ-110&nbsp;] where we demonstrate that the conventional application of linear models to the analysis of optoelectromechanical properties of nanostructures in bandstructure engineering could be inadequate and presented generalizations of the existing models for bandstructure calculations in the context of coupled effects.</p><p>Coupled effects&nbsp;in low dimensional nanostructures were considered in a series of paper [&nbsp;EJ-90&nbsp;,&nbsp;EJ-135&nbsp;,&nbsp;EJ-136&nbsp;,&nbsp;EJ-138&nbsp;]. In [&nbsp;EJ-90&nbsp;] the focus was on the dynamic coupling of piezoelectric effects, spontaneous polarization, and strain, while [&nbsp;EJ-136&nbsp;] was devoted on coupled electromechanical effects in finite length nanowires. In addition to a comprehensive comparison of two- and three- dimensional models, accounting for anisotropy and piezoelectricity, we also presented the results on the effects of the finite length of the nanowires on electromechanical field distributions. For the first time, the fully coupled thermo-electromechanical models in conjunction with the band structure analysis of quantum wires and quantum dots have been presented in [&nbsp;EJ-135&nbsp;] and [&nbsp;EJ-138&nbsp;], respectively.</p><p><br></p><p>Nonlinear strain models were considered also in the context of quantum dot molecules [&nbsp;EJ-79&nbsp;,&nbsp;EJ-81&nbsp;]. It was pointed out that the influence of strain effects is typically analyzed with simplified linear models based on the minimization of uncoupled, purely elastic energy functionals with respect to displacements . The applicability of such models is limited to the study of isolated idealized quantum dots, and both coupled and nonlinear effects need to be accounted for in the analysis of more realistic structures. In this paper, generalizations of the existing models for bandstructure calculations are discussed in the context of strain effects. Exemplifications are given for hexagonal wurtzite semiconductor nanostructures. Note also that the importance of coupled formulations in the analysis of electromechanical fields (including the context of piezoelectricity) was emphasized in our earlier works on electroelasticity (see details&nbsp;here).</p><p><br></p><p>Quantum dot molecules (or arrays) mentioned above have a number of promising applications, ranging from the construction of of quantum networks in information processing to biological systems. We analyzed several configurations of coupled quantum dots [ EP-QD-2010] where we used an external magnetic field as a control variable allowing to taylor the nanostructure properties. Further results in this direction can be found in [&nbsp;EJ-146&nbsp;]. Strain, electric, and thermal fields in the fully coupled modelling of low dimensional nanostructures can also serve as control variables.</p><p>Several special journal issues, where some of the state-of-the-art mathematical modelling tools for the analysis of low dimensional nanostructures, their applications and related topics, include [&nbsp;EJ-68&nbsp;,&nbsp;EJ-97&nbsp;,&nbsp;EJ-121&nbsp;,&nbsp;EJ-124&nbsp;].</p>",
                "pIndex": "1",
                "keywords": "",
                "project": 23,
                "created_at": "2020-07-13T05:09:06.746Z",
                "updated_at": "2020-11-11T02:12:25.452Z",
                "publications": [
                    121,
                    135,
                    304,
                    140,
                    125,
                    252,
                    284,
                    269,
                    123,
                    301,
                    278,
                    305,
                    124,
                    108,
                    281,
                    139,
                    286,
                    137,
                    260,
                    287,
                    148,
                    280,
                    142,
                    146,
                    254,
                    302,
                    184,
                    134,
                    136,
                    297,
                    267,
                    289
                ]
            },
            {
                "id": 2,
                "title": "Carbon nanotubes and their arrays in biological imaging and other applications, low-dimensional-nanostructure-based sensors and networks",
                "description": "",
                "link": null,
                "body": "<p>We are interested in the development of mathematical models for biological and chemical sensors (including those can be used in harsh environments for environmental monitoring), as well as for the field emission as an alternative to the conventional X-ray radiation. In particular, we proposed a series of new multiscale multi-physics models for the evolution of Carbon Nanotubes (CNTs) on thin films, numerical methods for the solution of the resulting problems, and we reported the efficiency of the proposed models and techniques based on theoretical, computational, and experimental results [&nbsp;EJ-112&nbsp;,EJ-116&nbsp;,&nbsp;EJ-122&nbsp;,&nbsp;EJ-131&nbsp;].</p><p><br></p><p>Zinc-oxide (ZnO) nanowires provide a promising element for efficient chemical sensors as well as for&nbsp;other applications. We have analyzed these materials with density functional theory and nonequilibrium Green's function technique in [&nbsp;EJ-125&nbsp;,&nbsp;EJ-139&nbsp;]. Such nanowires have also been used for sensor applications in biodetection and identification.</p><p><br></p><p>Our interest in this area includes also the development of mathematical models for the analysis of arrays (and ultimately networks) based on low dimensional nanostructures. In addition to CNT arrays described above and quantum dots arrays described in the previous section, other low dimensional nanostructures (e.g., nanowires) can also be used in designing such new structures and networks.</p>",
                "pIndex": "2",
                "keywords": "",
                "project": 23,
                "created_at": "2020-07-13T05:09:57.759Z",
                "updated_at": "2020-11-11T02:12:59.657Z",
                "publications": [
                    140,
                    132,
                    125,
                    122,
                    115,
                    110
                ]
            },
            {
                "id": 3,
                "title": "Nonlinear problems and low dimensional nanostructures, inverse problems, properties of materials and new phenomena at the nanoscale",
                "description": "",
                "link": null,
                "body": "<p>Nonlinear phenomena and associated mathematical problems are important parts of the analysis of low dimensional nanostructures. Our interests in this area include coupled mathematical models, in particular those that account for both classical and quantum phenomena. Our efforts in the development of nonlinear strain models has been described&nbsp;<a href=\"/research/projects/3\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: rgb(51, 51, 255);\">here</a>&nbsp;with basic summaries of the results found in [&nbsp;EJ-76&nbsp;,&nbsp;EJ-83&nbsp;,&nbsp;EJ-94&nbsp;,&nbsp;EJ-110&nbsp;].</p><p><br></p><p>Results on nonlinear&nbsp;current-voltage (&nbsp;I-V) characteristics of quantum nanowires&nbsp;as functions of&nbsp;the size of the metal contacts&nbsp;were reported in [&nbsp;EJ-95&nbsp;]. In this work transport phenomena were in the focus of our analysis of quantum wires where we applied quantum correction type models.</p><p><br></p><p>Many problems in the analysis of low dimensional nanostructures are reducible to eigenvalue PDE problems which subsequently have to be discretized. Nonlinear eigenvalue problems may arise in this context in several different ways and even in the linear case there are many non-trivial problems to be address[&nbsp;EJ-34&nbsp;]. Our interests include eigenvalue problems arising in the context of multiband theories and density functional models.</p><p>Our interest in this field also include size dependent effects, the influence of phase transformations (that may occur under different conditions, e.g. ion irradiation), as well as defects enhanced coupled phenomena and higher order effects (such as electrostriction) on properties of nanostructures [&nbsp;EP-79&nbsp;,&nbsp;EP-80&nbsp;,&nbsp;EP-81&nbsp;, EP-Rio-AIP-2009 , EP-ASME-2010].</p><p><br></p><p>Many important problems in nanoscience, nano- and bio-nanotechnological applications can be formulated mathematically as inverse problems. For example, the idea of designing nanostructures via inverse scattering leads to such problems. Subsequently, in some cases they can be reduced to a multiband Riccati model for the envelope function, ultimately allowing to control electronic structure and transport properties of the nanostructures being analyzed. The problems of interest here are not limited to quantum well situations, where the Gelfand-Levitan-Marchenko theory can be applied due to the one-dimensionality of the problem, as our interest includes also quantum wires and dots where problems become 2D and 3D, respectively.</p>",
                "pIndex": "3",
                "keywords": "",
                "project": 23,
                "created_at": "2020-07-13T05:10:46.074Z",
                "updated_at": "2020-11-11T02:14:39.123Z",
                "publications": [
                    286,
                    284,
                    302,
                    281,
                    301,
                    108,
                    289,
                    201,
                    287
                ]
            },
            {
                "id": 4,
                "title": "Quantum dots as reactive agents, open systems, boundary conditions, foundations of quantum mechanics",
                "description": "",
                "link": null,
                "body": "<p>With new properties of materials at the nanoscale, as compared to bulk materials, and their increasing range of applications, we should understand their properties as reactive agents much better. For example, one of the promising applications of quantum dots includes intracellular imaging where quantum dots are attached to selected molecules. In this and other applications, it is important to know cytotoxicity properties (toxicity to cells) of such quantum dots. Furthermore, key properties of quantum dots, such as quantum confinement, have a direct effect on their catalytic functions due to electron affinity (changes in the ability of quantum dots to accept/donate electron charge). As quantum dots often create reactive oxygen species (ROS), the key mechanisms of toxicity are usually attributed to the oxidation process. We are interested in the development of mathematical models for the description of these and associated processes. This development requires new approaches that can address fundamental problems and challenges that are on the border between classical and quantum mechanics. As nanostructures will play an increasingly important role in bioimaging, visualization of life critical processes in living organisms such as metabolic, and biomedicine, the developed models will be indispensable in this scientific advance.</p><p><br></p><p>Most problems we are facing in this area are multiscale, multiphysics problems as discussed&nbsp;earlier.</p><p>&nbsp;</p>",
                "pIndex": "4",
                "keywords": "",
                "project": 23,
                "created_at": "2020-07-13T05:11:43.221Z",
                "updated_at": "2020-07-29T05:15:47.398Z",
                "publications": []
            }
        ]
    },
    {
        "id": 4,
        "title": "Nonlocal || Far-from-equilibrium || Dynamic",
        "description": "We are interested in non-trivial dynamic processes, including but not limited to nonlocal and those that are far from their equilibrium, as well as in the associated phenomena and systems, and their modeling. Such processes occur frequently in systems ranging from semiconductor plasma to chemical and biological networks, and from tiny man-made nano-objects to living cell cycles.",
        "link": null,
        "body": "<p>We are interested in non-trivial dynamic processes, including but not limited to nonlocal and those that are far from their equilibrium, as well as in the associated phenomena and systems, and their modeling. Such processes occur frequently in systems ranging from semiconductor plasma to chemical and biological networks, and from tiny man-made nano-objects to living cell cycles. Furthermore, in some cases we need to optimize such processes or systems, while in other cases we need to find a control law such that a certain criterion is achieved for the process or system in question.</p><p><br></p><ul><li>Complex dynamics, stability, nonlocal and nonequilibrium processes;</li><li>Optimisation methodologies and control of complex systems.</li></ul>",
        "created_at": "2020-07-13T04:43:02.390Z",
        "updated_at": "2020-12-13T14:40:39.646Z",
        "featured": null,
        "sidebar": true,
        "order": null,
        "pIndex": "4",
        "keywords": null,
        "sideOrder": "4",
        "img": "/upload/S4.jpg",
        "subprojects": [
            {
                "id": 1,
                "title": "Complex dynamics, stability, nonlocal and nonequilibrium processes and phenomena",
                "description": "",
                "link": null,
                "body": "<p>Our contributions here include the analysis of systems with complex dynamic behaviour with important examples ranging from RNA nanostructures [&nbsp;EJ-137&nbsp;,&nbsp;EJ-145&nbsp;] to Carbon Nanotube (CNT) arrays&nbsp;[&nbsp;EJ-112&nbsp;,&nbsp;EJ-116&nbsp;,&nbsp;EJ-122&nbsp;,&nbsp;EJ-131&nbsp;], to nonlocal, non-equilibrium semiconductor plasma&nbsp;[&nbsp;EJ-20&nbsp;,&nbsp;EJ-30&nbsp;,&nbsp;EJ-32&nbsp;,&nbsp;EJ-37&nbsp;,&nbsp;EJ-51&nbsp;,&nbsp;EJ-70&nbsp;],&nbsp;and to low dimensional nanostructures [&nbsp;EJ-95&nbsp;]. Although these examples are from diverse areas of applications, they are unified by the fact that in all these examples we have to deal with nonlinear multiscale dynamic processes representing some of the key challenges of modern applied mathematics. The mathematical tools we develop and apply in our analysis of these processes are ranging from PDE-based coupled models (e.g., models of hydrodynamic type, drift-diffusion models, and quantum corrections of such models) to elaborate atomistic methodologies.</p><p><br></p><p>Dynamics in low dimensional nanostructures belongs to a class of problems of our continuing interest, in particular where we have to account for dynamic coupling of different phenomena or processes [&nbsp;EJ-90&nbsp;]. Many problems in the field of nanoscience require efficient solutions of eigenvalue PDE problems which subsequently are discretized. The dynamics of coupling between spectrum and resolvent under epsilon-pertubations of operator and matrix spectra were studied both theoretically and numerically in [&nbsp;EJ-34&nbsp;].&nbsp;The phenomenon of non-trivial pseudospectra encountered in these dynamics was treated by relating information in the complex plane to the behaviour of operators and matrices.&nbsp;We are also interested in several fundamental problems for multiband effective mass theory as applied to low dimensional nanostructures [&nbsp;EJ-83&nbsp;,&nbsp;EJ-94&nbsp;,&nbsp;EJ-133&nbsp;].</p><p>On a more classical level, we were successful in generalizing the Courant-Friedrichs-Lewy condition to coupled dynamic problems of electroelasticity; we showed for the fist time the well-posedness of such problems, analyzed regularity of their solutions, and proposed efficient variational-difference numerical approximations [&nbsp;EJ-1&nbsp;,&nbsp;EJ-11&nbsp;,&nbsp;EJ-13&nbsp;,&nbsp;EJ-22&nbsp;,&nbsp;EJ-24&nbsp;,&nbsp;EJ-26&nbsp;,&nbsp;EJ-29&nbsp;,&nbsp;EJ-31&nbsp;,&nbsp;EJ-71&nbsp;]. General discrete models for dynamic coupled thermoelasticity were discussed in [&nbsp;EJ-41&nbsp;] where we also developed the Cayley transform technique for the analysis of stability of numerical approximations for these coupled problems. Non-trivial dynamic phenomena such as thermal spiking and degradation were analyzed by us for the first time in the context of mixed (ODEs and PDEs) coupled systems [&nbsp;EJ-45&nbsp;,&nbsp;EJ-59&nbsp;].&nbsp;Another topic of interest was the study of the effect of thermal damage induced by ultrashort pulsed lasers [&nbsp;EJ-89&nbsp;,&nbsp;EJ-96&nbsp;,&nbsp;EJ-119&nbsp;].&nbsp;We also contributed to the development of models based on the hyperbolic heat conduction where the standard Fourier law is replaced by the Cattaneo-Vernotte law in the context of extended thermodynamics [&nbsp;EJ-28&nbsp;,&nbsp;EJ-40&nbsp;,&nbsp;EJ-49&nbsp;,&nbsp;EJ-78&nbsp;].</p><p><br></p><p>We are interested in transport phenomena and dynamic problems not only in the context of physical and engineering systems, but also in the context of biological and socio-economic systems, including finance. Our contributions to the latter can be found&nbsp;here. In addition to RNA nanostructures [&nbsp;EJ-137&nbsp;,&nbsp;EJ-145&nbsp;] , in the context of the former we are also interested in RNA silencing phenomena&nbsp;[&nbsp;EP-67&nbsp;], DNA (and other complex molecules) relaxation dynamics&nbsp;[&nbsp;EJ-105&nbsp;,&nbsp;EJ-109&nbsp;],&nbsp;modelling genetic networks as a multiscale process [&nbsp;EP-37&nbsp;] (as well as in modeling other networks arising in physical, biological, and engineering sciences),&nbsp;and the dynamics of cell cycles&nbsp;[&nbsp;EJ-130&nbsp;].</p><p>In dealing with a number of problems listed above, in some cases we encounter highly oscillatory functions characterizing certain processes or phenomena, but given with incomplete information. The development of efficient formulae for numerical integration of such functions is a well-known challenge, and we developed and theoretically justified several classes of optimal formulae for numerical integration of highly oscillatory functions in both one- and multi-dimensional cases [&nbsp;EJ-27&nbsp;,&nbsp;EJ-43&nbsp;,&nbsp;EJ-48&nbsp;,&nbsp;EJ-66&nbsp;]. We have also been working on geometric and variational approaches in the analysis of complex dynamics.</p><p><br></p><p>Nonequilibrium Molecular Dynamics (NMD) is a subject that goes back to works by Fermi. By using NMD, we explored geometry and temperature dependent properties of materials at different scales, including the analysis of such properties in low dimensional nanostructures. Our interests include structural, thermodynamic, mechanical, transport, and optoelectronic properties, as well as relative and phase stability of materials at the nanoscale. Other tools that we are developing in these studies&nbsp;are based on first principles calculations, nonequilibrium Green's function techniques and density functional theory&nbsp;&nbsp;[&nbsp;EJ-123&nbsp;,&nbsp;EJ-125&nbsp;,&nbsp;EJ-134&nbsp;,&nbsp;EJ-139&nbsp;,&nbsp;EJ-140&nbsp;,&nbsp;EJ-144&nbsp;].</p><p>&nbsp;</p>",
                "pIndex": "1",
                "keywords": "",
                "project": 24,
                "created_at": "2020-07-13T05:12:40.656Z",
                "updated_at": "2020-11-11T02:31:36.801Z",
                "publications": [
                    135,
                    264,
                    140,
                    180,
                    224,
                    283,
                    187,
                    130,
                    274,
                    77,
                    295,
                    106,
                    110,
                    297,
                    147,
                    123,
                    102,
                    230,
                    197,
                    225,
                    201,
                    134,
                    246,
                    289,
                    191,
                    206,
                    115,
                    213,
                    142,
                    132,
                    125,
                    131,
                    186,
                    212,
                    219,
                    303,
                    146,
                    118,
                    195,
                    178,
                    301,
                    138,
                    122,
                    189,
                    302,
                    276,
                    196,
                    107,
                    182,
                    215
                ]
            },
            {
                "id": 2,
                "title": "Optimization methodologies and control of complex systems",
                "description": "",
                "link": null,
                "body": "<p>We are interested in optimization of complex systems such as multicomponent, multiphase materials and systems, polymers, composites.</p><p>For example,&nbsp;in solving such problems with atomistic and Molecular Dynamics (MD) tools, an initial topological optimization can lead to a substantial speed up of subsequent computations. New efficient algorithms for such an optimization were discussed in [&nbsp;EJ-58&nbsp;] based on several distance geometry ideas.&nbsp;Another example includes multiphase materials where we proposed and applied&nbsp;a new hybrid optimization procedure in the context of shape memory materials [&nbsp;EJ-118&nbsp;].</p><p><br></p><p>We are also interested in control of complex systems. In particular, in [&nbsp;EJ-60&nbsp;] in the context of control theory we analyzed in detail a theoretical framework for deterministic and stochastic dynamics with hyperbolic Hamilton-Jacobi-Bellman equations. It was proposed to approximate the original controlled dynamics with a sequence of PDEs. By applying the Steklov-Poincare operator technique the general form of equations in such a sequence was established. In [&nbsp;EJ-21&nbsp;] we dealt with nonsmooth optimal control problems in the case when the control was allowed to be a discontinuous function. We analysed smoothness assumptions on an adjoint process in deterministic and stochastic cases. Possibilities of steep generalized space-gradients of the adjoint function implied the necessity of an approximation of the Hamiltonian. The key question of such an approximation is a relationship between the control and the value function. Under quite general assumptions it was proved that the performance measure for the original process is determined by the control function with possible discontinuities. Many complex systems operate under the presence of uncertainty which may include human factors. It is known that with the increasing complexity of technological systems that operate in dynamically changing environments and require human supervision or a human operator, the relative share of human errors is increasing across all modern applications. This indicates that in the analysis and control of such systems, human factors should not be eliminated by conventional formal mathematical methodologies. Instead, they must be incorporated into the modelling framework. These issues were addressed in [&nbsp;EJ-129&nbsp;]. We demonstrated that the problem can be reduced to a set of Hamilton-Jacobi-Bellman equations where human factors are incorporated via estimations of the system Hamiltonian. The proposed methodology provides a way to integrate human factors into the solving process of the models for complex dynamic systems.</p><p><br></p><p>The topic of particular interest is control of low dimensional nanostructures and other physical and biological systems at the nanoscale. In the context of low dimensional nanostructures, our control parameters may include strain, thermal, piezoelectric, and magnetic fields, depending on the types of problems at hand [&nbsp;EJ-76&nbsp;,&nbsp;EJ-90&nbsp;,&nbsp;EJ-94&nbsp;,&nbsp;EJ-135&nbsp;,&nbsp;EJ-138&nbsp;].</p><p>&nbsp;</p>",
                "pIndex": "2",
                "keywords": "",
                "project": 24,
                "created_at": "2020-07-13T05:13:18.148Z",
                "updated_at": "2020-11-11T02:33:56.279Z",
                "publications": [
                    244,
                    301,
                    249,
                    281,
                    297,
                    179,
                    117,
                    136,
                    129,
                    139
                ]
            }
        ]
    },
    {
        "id": 5,
        "title": "Stochastic || Networks || Uncertainty",
        "description": "In modeling many phenomena and processes in Nature as well as in man-made systems there is often some indeterminacy in the future evolution of such systems, phenomena, and processes that, by the language of mathematics, can be described by probability distributions. ",
        "link": null,
        "body": "<p>In modeling many phenomena and processes in Nature as well as in man-made systems there is often some indeterminacy in the future evolution of such systems, phenomena, and processes that, by the language of mathematics, can be described by probability distributions. This includes both traditional areas of science &amp; engineering as well as such areas as finance, business, social sciences and economics where in a number of cases tools of applied probability become very important.</p><p><br></p><ul><li>Stochastic models in biological, environmental, and social sciences;</li><li>Monte Carlo based non-perturbative approaches, critical phenomena and phase transitions in large lattices;</li><li>First passage time problems in finance, science &amp; engineering, risk assessment and uncertainty management, human factors, complex systems and networks;</li><li>Markov Chain approximation and evolution.</li></ul>",
        "created_at": "2020-07-13T04:47:51.724Z",
        "updated_at": "2020-07-29T05:16:04.700Z",
        "featured": null,
        "sidebar": true,
        "order": null,
        "pIndex": "5",
        "keywords": null,
        "sideOrder": "5",
        "img": "/upload/S5.png",
        "subprojects": [
            {
                "id": 1,
                "title": "Stochastic models in biological and environmental sciences",
                "description": "",
                "link": null,
                "body": "<p>Cell cycles are fundamental components of all living organisms and their systematic studies extend our knowledge about the interconnection between regulatory, metabolic, and signaling networks, and therefore open new opportunities for our ultimate efficient control of cellular processes for disease treatments, as well as for a wide variety of biomedical and biotechnological applications. In the study of cell cycles, nonlinear phenomena play a paramount role, in particular in those cases where the cellular dynamics is in the focus of attention. Quantification of this dynamics is a challenging task due to a wide range of parameters that require estimations and the presence of many stochastic effects. Based on the originally deterministic model, in [&nbsp;EJ-130&nbsp;] we developed a hierarchy of models that allow us to describe the nonlinear dynamics accounting for special events of cell cycles. We considered the influence of stochasticity in the analysis of cell cycle dynamics by accounting fluctuations of relative concentrations of proteins during special events of cell cycles and demonstrated that the metabolic events in gene regulatory networks can qualitatively influence the dynamics of the cell cycle.</p><p><br></p><p>Most interesting problems in biological, environmental and materials sciences are multiscale with a range of spatial and temporal scales as discussed in [&nbsp;EJ-58&nbsp;]. In solving such problems with atomistic and Molecular Dynamics (MD) tools, an initial topological optimization can lead to a substantial speed up of subsequent computations. New efficient algorithms for such an optimization were discussed in [&nbsp;EJ-58&nbsp;] based on several distance geometry ideas. In applying MD tools, we often have to choose between different schemes of stochastic thermostats, e.g. Langevin, Berendsen, etc in such a way that the `fluctuation-dissipation' theorem is obeyed to guarantee the chosen statistics. These tools provide a powerful technique for the analysis of complex biological structures. In [&nbsp;EJ-137&nbsp;] we applied these tools for the analysis of RNA nanostructures where we discovered a phenomenon of self-stabilization. Ribonucleic acid (RNA) has been proposed as a promising alternative to DNA and proteins for the design of the artificial self-assembled materials at nanoscale (e.g. [1] and references therein). As compared to DNA and some other bio-molecules, RNA offers not only a much greater variety of interactions but also such an important feature as great conformational flexibility of RNA structures. This feature is used by Nature via the ubiquitous catalytic function of RNA, and now it also makes RNA a very promising functional nano-material for the design of the man-made molecular devices and systems. We presented several promising multiscale methodologies for simulation of such biomolecular systems as RNA nanostructures, focusing on the development of a hierarchy of simplified coarse-grained mesoscopic models suitable for the description of such biological nanostructures and details of this can be found in [&nbsp;EJ-145&nbsp;].</p><p><br></p><p>The coarse-graining approach is one of the most important modeling methods in research of long-chain polymers such as DNA molecules.&nbsp;We applied several such models for the analysis of polymeric fluids and relaxation of DNA bio-molecules [&nbsp;EJ-105&nbsp;,&nbsp;EJ-109&nbsp;,&nbsp;EJ-126&nbsp;]. We analyzed the behavour of these systems under different shear rates [&nbsp;EJ-109&nbsp;], extensional flows [&nbsp;EJ-126&nbsp;], and provided new results of Brownian dynamics simulations of single DNA molecules in shear flows taking into account the effect of internal viscosity [&nbsp;EJ-105&nbsp;] where our model included the Smoluchowski equation.</p><p>Climate systems models have been discussed by us earlier in&nbsp;[&nbsp;EJ-23&nbsp;]&nbsp;with the error analysis discussion found in[&nbsp;EP-3&nbsp;]. Other topics of interest in biological, medical and environmental sciences can be found&nbsp;here.</p>",
                "pIndex": "1",
                "keywords": "",
                "project": 26,
                "created_at": "2020-07-13T05:14:45.621Z",
                "updated_at": "2020-11-11T02:36:55.231Z",
                "publications": [
                    106,
                    255,
                    131,
                    244,
                    138,
                    126,
                    102,
                    181,
                    147
                ]
            },
            {
                "id": 2,
                "title": "Monte Carlo based non-perturbative approaches, critical phenomena and phase transitions in large lattices",
                "description": "",
                "link": null,
                "body": "<p>It is well-known that restricting geometry of a many particle system can have fundamental effects on phase transition phenomena.&nbsp;Even for relatively simple ideal geometries, we frequently observe rich behaviors due to a competition between different types of effects, e.g. surface effects and finite size effects.&nbsp;When the transition changes its character (e.g., form three-dimensional to two-dimensional as well as in other cases), critical exponents will also change. It is very important to be able to predict such exponents with a sufficient degree of accuracy in a range of physically relevant situations. In a series of publications [&nbsp;EJ-103&nbsp;,&nbsp;EJ-115&nbsp;,&nbsp;EJ-143&nbsp;] we focused on the study of a number of lattice spin models near the critical (phase transition) point by using non-perturbative approaches based on Monte-Carlo methods.&nbsp;We started with the XY models and demonstrated how more accurate (than previously known) estimates of critical exponents can be obtained [&nbsp;EJ-103&nbsp;,&nbsp;EJ-115&nbsp;] . We also applied our methodology to the analysis of Goldstone singularity in such models by using the efficient procedures we initiated [&nbsp;EJ-103&nbsp;], and applied the three-dimensional O(4) model in the ordered phase to study the Goldstone mode effects [&nbsp;EJ-143&nbsp;]. The Wolff cluster algorithm provides one of the most effective tools to simulate important properties of many particle systems near the critical point. However, a major drawback in the application of this algorithm were related to difficulties in its parallelization, in particular in the application to large lattices. On the example of three-dimensional Ising models, in [&nbsp;EJ-142&nbsp;] we demonstrated for the first time how parallelization of the Wolff single cluster algorithm can be achieved. Our procedure is generalizable to other lattice spin models and provides an important new tool for the simulation of very large lattices near the critical phase transition point.</p>",
                "pIndex": "2",
                "keywords": "",
                "project": 26,
                "created_at": "2020-07-13T05:15:17.941Z",
                "updated_at": "2020-11-11T02:37:30.092Z",
                "publications": [
                    144,
                    100,
                    145,
                    114
                ]
            },
            {
                "id": 3,
                "title": "First passage time problems in finance, science & engineering, risk assessment and uncertainty management, human factors, complex systems and networks",
                "description": "",
                "link": null,
                "body": "<p>We are interested in modelling financial and socio-economic phenomena where uncertainty presence may lead to qualitatively different dynamics. Our major interests here focus on the First Passage Time problems and the development of efficient numerical methodologies for their solution, but our interests include also inverse problems in financial mathematics and several other areas. Mathematically, FPT problem can be reduced to estimating the probability of a stochastic process first to reach a boundary level. In most important applications in the financial industry, the FPT problem does not have an analytical solution and the development of efficient numerical methods becomes the only practical avenue for its solution.&nbsp;We developed a fast Monte Carlo method in the case of multivariate (and correlated) jump-diffusion processes&nbsp;( JDP). This development and its generalization [&nbsp;EJ-108&nbsp;,&nbsp;EJ-128&nbsp;] allows us, among other things, to evaluate the default events of several correlated assets based on a set of empirical data. The developed technique is an efficient tool for a number of financial, economic, and business applications, such as credit analysis, barrier option pricing, macroeconomic dynamics, and the evaluation of risk, as well as for a number of other areas of applications in science and engineering, where the FPT problem arises.</p><p><br></p><p>Uncertainly management is another area of interest. We were analyzing uncertainty management in the presence of human factors. It is known that with the increasing complexity of technological systems that operate in dynamically changing environments and require human supervision or a human operator, the relative share of human errors is increasing across all modern applications. This indicates that in the analysis and control of such systems, human factors should not be eliminated by conventional formal mathematical methodologies. Instead, they must be incorporated into the modelling framework. These issues were addressed in [&nbsp;EJ-129&nbsp;]. We demonstrated that the problem can be reduced to a set of Hamilton-Jacobi-Bellman equations where human factors are incorporated via estimations of the system Hamiltonian. The proposed methodology provides a way to integrate human factors into the solving process of the models for complex dynamic systems.</p><p><br></p><p>In a number of applied problems we have to deal with highly oscillatory functions characterizing certain processes or phenomena and given with incomplete information. The development of efficient formulae for numerical integration of such functions is a well-known challenge, and we developed and theoretically justified several classes of optimal formulae for numerical integration of highly oscillatory functions in one- and multi-dimensional cases [&nbsp;EJ-27&nbsp;,&nbsp;EJ-43&nbsp;,&nbsp;EJ-48&nbsp;,&nbsp;EJ-66&nbsp;], focusing on the cases with incomplete information available.</p><p>&nbsp;</p>",
                "pIndex": "3",
                "keywords": "",
                "project": 26,
                "created_at": "2020-07-13T05:15:49.720Z",
                "updated_at": "2020-11-11T02:39:57.208Z",
                "publications": [
                    128,
                    215,
                    105,
                    264,
                    187,
                    224,
                    129
                ]
            },
            {
                "id": 4,
                "title": "Markov Chain approximation and evolution",
                "description": "",
                "link": null,
                "body": "<p>Many concepts and tools used in information theory, control, theory of approximation, dynamical systems and artificial intelligence are closely linked. Among such tools are neural networks. We proposed a general framework for the analysis of a connection between the training of artificial neural networks via the dynamics of Markov chains and the approximation of conservation law equations [&nbsp;EJ-120&nbsp;]. This framework allows us to demonstrate an intrinsic link between microscopic and macroscopic models for evolution via the concept of perturbed generalized dynamic systems introduced earlier in [&nbsp;EJ-25&nbsp;].&nbsp;A number of related theoretical questions were analyzed in [&nbsp;EJ-21&nbsp;,&nbsp;EJ-60&nbsp;]. In particular, in [&nbsp;EJ-60&nbsp;] we analyzed in detail a theoretical framework for deterministic and stochastic dynamics with hyperbolic Hamilton-Jacobi-Bellman equations. It was proposed to approximate the original controlled dynamics with a sequence of PDEs. By applying the Steklov-Poincare operator technique the general form of equations in such a sequence was established. In [&nbsp;EJ-21&nbsp;] we dealt with nonsmooth optimal control problems in the case when the control was allowed to be a discontinuous function. We analyzed smoothness assumptions on an adjoint process in deterministic and stochastic cases. Possibilities of steep generalized space-gradients of the adjoint function implied the necessity of an approximation of the Hamiltonian. The key question of such an approximation is a relationship between the control and the value function. Under quite general assumptions it was proved that the performance measure for the original process is determined by the control function with possible discontinuities.</p>",
                "pIndex": "4",
                "keywords": "",
                "project": 26,
                "created_at": "2020-07-13T05:17:13.504Z",
                "updated_at": "2020-11-11T02:40:39.868Z",
                "publications": [
                    184,
                    249,
                    179,
                    120
                ]
            }
        ]
    },
    {
        "id": 6,
        "title": "Environment || Industry || Sustainable Development",
        "description": "As it stands now, humanity depletes its resources with an astronomical speed, much faster than they can be replenished. It is important to understand that the only way for our further development could be a balance between our needs and preserving the environment. We are interested in the development of mathematical foundations for and mathematical modeling of alternative and renewable sources of energy.",
        "link": null,
        "body": "<p>As it stands now, humanity depletes its resources with an astronomical speed, much faster than they can be replenished. It is important to understand that the only way for our further development could be a balance between our needs and preserving the environment. We are interested in the development of mathematical foundations for and mathematical modeling of alternative and renewable sources of energy. Such sources should help reducing the damage to the environment caused by more traditional sources of energy and fuels. This includes, for example, solar energy. We are also interested in the development of biological and chemical sensors that, along with other applications, would allow better environmental monitoring. Although small particles originating from human activities have been around since the dawn of our civilization, our technological development has dramatically increased the variety of such particle chemical compositions. With the advance of nanotechnology, we have to be aware of the effects such particles may produce. These and other issues of health and environments and their relationship to modern technologies are part of our interests in these focus area.</p><p><br></p><ul><li>Mathematical models for renewable and alternative sources of energy; Environmentally friendly materials and technologies;</li><li>Industrial &amp; engineering applications of mathematics;</li><li>Climate models and uncertainty propagation; photosynthetic systems and their applications;</li><li>Mathematical models for medical and environmental sciences.</li></ul>",
        "created_at": "2020-07-13T04:50:16.072Z",
        "updated_at": "2020-07-29T05:16:13.019Z",
        "featured": null,
        "sidebar": true,
        "order": null,
        "pIndex": "6",
        "keywords": null,
        "sideOrder": "6",
        "img": "/upload/S6.png",
        "subprojects": [
            {
                "id": 1,
                "title": "Mathematical models for renewable and alternative sources of energy",
                "description": "",
                "link": null,
                "body": "<p>We are interested in the mathematical modelling of systems and devices that would speed up the usage of solar energy. This includes, for example, grid-connected photovoltaic systems that are currently rapidly expanding, providing a viable technology for renewable energy resources [&nbsp;EJ-64&nbsp;].&nbsp;The solar cell industry promises new and clean sources of power and low dimensional nanostructures such as quantum dots play an important role in this industry. A solar cell can convert the energy of sunlight directly into electricity by using the photovoltaic effect.&nbsp;We have developed efficient mathematical models for predicting properties of quantum dots. These semiconductor structures have quantum optical properties absent in the bulk material and can be very useful in solar-electric energy conversions. The developed mathematical models can be applied to a range of different materials. Results on Cd-based and GaAs-based nanostructures are given in [&nbsp;EJ-135&nbsp;,&nbsp;EJ-136&nbsp;,&nbsp;EJ-138&nbsp;] and [&nbsp;EJ-51&nbsp;,&nbsp;EJ-61&nbsp;,&nbsp;EJ-63&nbsp;,&nbsp;EJ-75,&nbsp;EJ-95&nbsp;] (also proceedings [&nbsp;EP-34&nbsp;]), respectively. Some results on properties of Cd-based nanostructures obtained with first principles calculations can be found in [&nbsp;EJ-123&nbsp;]. Results on modelling GaN-based low dimensional nanostructures have been reported in [&nbsp;EJ-90,&nbsp;EJ-138&nbsp;] (also proceedings [&nbsp;EP-63&nbsp;,&nbsp;EP-79&nbsp;]).Furthermore, we note that by using quantum dot arrays [&nbsp;EJ-79&nbsp;], a very high efficiency of solar-electric conversion can be archived. In particular, harvesting the maximum proportion of the incident light can be archived if we would use an array of different size quantum dots. We have analyzed&nbsp;size and shape effects in quantum dots and other low dimensional nanostructures in a series of our publications [&nbsp;EJ-62&nbsp;,&nbsp;EJ-65&nbsp;,&nbsp;EJ-73&nbsp;] (also proceedings [&nbsp;EP-25&nbsp;, Cambridge-2010 ]).</p><p><br></p><p>It is also known that ZnO based low dimensional nanostructures can also be used in solar cells and we have analyzed these materials with density functional theory and nonequilibrium Green's function technique in [&nbsp;EJ-125&nbsp;,&nbsp;EJ-139&nbsp;].</p><p><br></p><p>We have analyzed systems for energy transfer (power generation/refrigeration) via the Peltier effects in the context of thermoelectric materials [&nbsp;EJ-42&nbsp;,&nbsp;EJ-74&nbsp;], the materials which we explored also in the context of low dimensional nanostructures [&nbsp;EJ-138&nbsp;]. Currently, thermoelectrics are being explored as an important element of solar thermal energy generation systems and similar systems for alternative sources of energy.</p><p>Our other contributions include the development of nonlinear models for the description of dynamic properties of electric vehicles [&nbsp;EJ-54&nbsp;], as well as mathematical models for an environmental friendly methodology for the implementation of heat recovery and airflow control systems [&nbsp;EJ-87&nbsp;,&nbsp;EJ-102&nbsp;].</p><p>For more information on mathematical models for quantum dots, please see&nbsp;here.</p>",
                "pIndex": "1",
                "keywords": "",
                "project": 27,
                "created_at": "2020-07-13T05:18:15.484Z",
                "updated_at": "2020-11-11T02:45:08.800Z",
                "publications": [
                    333,
                    279,
                    263,
                    230,
                    254,
                    293,
                    137,
                    237,
                    260,
                    302,
                    280,
                    284,
                    214,
                    258,
                    139,
                    140,
                    297,
                    256,
                    125,
                    123,
                    252,
                    350,
                    136,
                    99,
                    278,
                    245
                ]
            },
            {
                "id": 2,
                "title": "Industrial & engineering applications of mathematics",
                "description": "",
                "link": null,
                "body": "<p>In this field, our research is closely related to the following technologies:</p><ul><li>nanotechnology and bio-nanotechnology;</li><li>sensors and actuators technology; smart materials and structures technology;&nbsp;nondestructive evaluation technology;</li><li>technologies relying on interactions of structures with gas/fluids and on solving multi-physics, multiscale problems.</li><li><br></li></ul><p>A fairly detailed account of our research in the field of nanotechnology can be found&nbsp;here. In many ways, the class of problems in bio-nanotechnology we are interested in has been motivated by our interest in multiscale mathematical problems in biology, medicine, and nanotechnology. Details of this are given in the&nbsp;next section&nbsp;and&nbsp;here.</p><p><br></p><p>Sensors and actuators are key elements for humans and for human-made systems to interact with our environment. Many sensors and actuators are designed based on smart materials and in this sense these two technologies are not independent. Furthermore, due to a trend of reducing the size of sensors and actuators, in many applications nanotechnology plays an increasingly important role in this field. These technologies (separately or in their combination) have opened opportunities for nondestructive testing which includes a range of methodologies from ultrasonic to electromagnetic and to optic methods.&nbsp;In a nutshell (and apart from nanotechnological issues which are discussed separately&nbsp;<a href=\"http://www.m2netlab.wlu.ca/research/mathematics-nano-science.html\" rel=\"noopener noreferrer\" target=\"_blank\">here</a>), our interest in this diverse field focuses on piezoelectric and shape memory materials (SMA) and devices, but include also other smart (intelligent, adaptive) materials such as electroactive polymers and ferroelectrics, as well as thermoelectrics and other materials and devices based on these materials. Some of the publications on thermoelectric SMA actuators and shape memory alloys in engineering and industrial context can be found in [&nbsp;EJ-42&nbsp;] and [&nbsp;EJ-69&nbsp;,&nbsp;EJ-91&nbsp;,&nbsp;EJ-92&nbsp;,&nbsp;EJ-100&nbsp;,&nbsp;EJ-111&nbsp;,&nbsp;EJ-114&nbsp;,&nbsp;EJ-117&nbsp;], respectively (with a more detailed account on these and other coupled problems found&nbsp;here&nbsp;and in a number of special journal issues, including [&nbsp;EJ-68&nbsp;,&nbsp;EJ-84&nbsp;,&nbsp;EJ-88&nbsp;,&nbsp;EJ-97&nbsp;,&nbsp;EJ-113&nbsp;,&nbsp;EJ-121&nbsp;,&nbsp;EJ-124&nbsp;]).</p><p><br></p><p>Thermal analysis of complex systems in industrial applications, developing mathematical models and numerical discretization for such an analysis, has been a topic of continuing interest, covering nonlinear mathematical models for thermal analysis of integrated circuits in semiconductor industry [&nbsp;EJ-12&nbsp;,&nbsp;EJ-16&nbsp;] as well as mathematical models for thermal analysis of electric induction motors [&nbsp;EJ-52&nbsp;]. We also developed a new model and numerical approximation to analyze the effect of the presence of molecular water impurity of various concentrations in absorbing and scattering glass media on the temperature field in a layer subjected to thermal infrared radiation [&nbsp;EJ-77&nbsp;]. Our contributions to the development of efficient numerical procedures for energy balance models are found in [&nbsp;EJ-20&nbsp;,&nbsp;EJ-30&nbsp;,&nbsp;EJ-32&nbsp;,&nbsp;EJ-37&nbsp;,&nbsp;EJ-51&nbsp;,&nbsp;EJ-70&nbsp;] . Such models are able to account for non-local, non-equilibrium processes and have a wide range of applicability. We demonstrated the efficiency of the developed models and their numerical approximations in describing important phenomena in semiconductor plasma, including velocity overshoot, fast photo-response of optically sensitive semiconductors for photonics applications and others. Our contributions to modelling complex systems&nbsp;for renewable and alternative sources of energy&nbsp;can be found&nbsp;here, while more details on applied coupled problems of industrial interest, including thermoelasticity, electroelasticity and others, can be found&nbsp;here.</p><p><br></p><p>The dynamic behaviour of ferroelectric materials and multilayer structures is an important component of many current and potential applications. Mathematically, associated mathematical models are strongly nonlinear and represent substantial challenges for the analysis and the development of efficient numerical techniques. By symmetry considerations, most ferroelectric materials are also piezoelectric and pyroelectric which make them very useful as capacitors in sensor applications, among many others. We developed an efficient model for the analysis of these materials, as well as numerical procedures to carry out such an analysis, and some cases their control [&nbsp;EJ-127&nbsp;,&nbsp;EJ-132&nbsp;,&nbsp;EJ-141].</p><p>The analysis of thermo-piezoelectric coupling was carried out in [&nbsp;EJ-39&nbsp;,&nbsp;EJ-56&nbsp;] and the full coupling between a piezoelectric structure and gas/fluid media has been analyzed by us in [&nbsp;EJ-50&nbsp;,&nbsp;EJ-85&nbsp;] where we also discussed the solution methodology for such coupled problems.</p><p>The importance of and trends in interdisciplinary education were discussed in our contribution [&nbsp;EJ-57&nbsp;] where we proposed core curriculum subjects for university departments specializing in or with a strong component of applied mathematics and mathematical modelling, reflecting interdisciplinary challenges that must be part of new educational practices .</p><p>Several special journals issues appeared where many challenging problems of industrial and engineering mathematics can be found along with state-of-the-art tools for their solutions [&nbsp;EJ-68&nbsp;,&nbsp;EJ-88&nbsp;,&nbsp;EJ-97&nbsp;,&nbsp;EJ-113&nbsp;,&nbsp;EJ-121&nbsp;,&nbsp;EJ-124&nbsp;].</p><p>&nbsp;</p>",
                "pIndex": "2",
                "keywords": "",
                "project": 27,
                "created_at": "2020-07-13T05:19:11.737Z",
                "updated_at": "2020-11-11T02:55:13.349Z",
                "publications": [
                    121,
                    291,
                    240,
                    206,
                    209,
                    127,
                    195,
                    133,
                    227,
                    143,
                    124,
                    563,
                    274,
                    269,
                    112,
                    230,
                    298,
                    178,
                    242,
                    270,
                    299,
                    116,
                    214,
                    294,
                    197,
                    282,
                    109,
                    163,
                    111,
                    97,
                    119,
                    304,
                    290
                ]
            },
            {
                "id": 3,
                "title": "Mathematical models for medical and environmental sciences",
                "description": "",
                "link": null,
                "body": "<p>We analyzed several systems for drug delivery [&nbsp;EJ-47&nbsp;] and looked into novel potential applications of RNA nanostructures in medical sciences, focusing on studying their properties [&nbsp;EJ-137&nbsp;,&nbsp;EJ-145&nbsp;].</p><p><br></p><p>We contributed to the development of mathematical models and efficient numerical methods for dynamic problems in bio-inspired materials such as shape memory alloys (SMAs). These materials find a wide range of applications in orthodontics and dental biomechanics , optometry, orthopedic surgery, biologically-friendly replacements in body cavities, arteries and other vascular applications, implants, and in various surgery instruments. While there exists a vast amount of literature on constitutive and time-independent modelling of SMAs and SMA-based systems, our main focus over the years has been of the dynamics. This is quite important feature in biological and medical applications of SMAs. Two key technologies are related to this: smart materials and structures technology and nondestructive evaluation technology. The latter includes&nbsp;the development of non-invasive (or less invasive) medical diagnostics.&nbsp;We first proposed a reduction of the full 3D PDE-based models for materials with shape memory to a more tractable differential-algebraic systems [&nbsp;EJ-33&nbsp;] (further discussed in [&nbsp;EJ-93&nbsp;] for both uncoupled and coupled problems). This allowed to treat both stress-induced and temperature-induced phase transformations in these materials and related hysteresis phenomena in a unified manner [&nbsp;EJ-44&nbsp;], with further generalization to include hyperbolicity of heat conduction to follow [&nbsp;EJ-49&nbsp;]. Conservative numerical approximations in this field of dynamic problems were developed and justified mathematically in [&nbsp;EJ-53&nbsp;,&nbsp;EJ-72&nbsp;]. Chebyshev's collocation and Chebyshev's spectral procedures were developed for these problems in [&nbsp;EJ-100&nbsp;,&nbsp;EJ-107&nbsp;] (also proceedings [ Cruz-2009 ]) which also included the Rayleigh dissipation term [&nbsp;EJ-111&nbsp;]. A new hybrid optimization procedure was developed and applied in [&nbsp;EJ-118&nbsp;]. We developed a Finite Element Method (FEM) based approach that incorporates the lattice kinetics, involving the order variables, and non-equilibrium thermodynamics [&nbsp;EJ-114&nbsp;]. Its variants, including those applied to 3D problems, were discussed in detail in [&nbsp;EJ-82&nbsp;,&nbsp;EJ-92&nbsp;,&nbsp;EJ-104&nbsp;] and our new Finite Volume Method procedure for these dynamic problems was reported in [&nbsp;EJ-101&nbsp;]. We have also developed several efficient procedures for model reductions in this field based on the manifold reduction, the Proper Orthogonal Decomposition (POD), and the Galerkin projection techniques [&nbsp;EJ-33&nbsp;,&nbsp;EJ-55&nbsp;,&nbsp;EJ-106&nbsp;,&nbsp;EJ-141&nbsp;]. More details on our research into the dynamics of SMAs and SMA-based devices can be found&nbsp;here.</p><p><br></p><p>Polymers and composites are another class of materials that find numerous important applications in medical and biological science. Some of our contributions to this field can be found in [&nbsp;EJ-58&nbsp;,&nbsp;EJ-78&nbsp;,&nbsp;EJ-105&nbsp;,&nbsp;EJ-109&nbsp;,&nbsp;EJ-126&nbsp;]. We note that that in polymeric materials applied in medical applications there are many non-trivial phenomena that need to be understood much better. We initiated the analysis of one such phenomena known as thermal spiking. We developed a new model for this phenomenon, as well as an efficient method for its numerical solution, and presented results on thermal spiking on an example of bone cement [&nbsp;EJ-45&nbsp;,&nbsp;EJ-59]. We showed that mathematically such problems are reducible to a coupled system of ODEs and PDE. Other authors used such mixed coupled models for other biological and medical applications, e.g. in vascular remodelling in biological tissues. The techniques we developed may proved to be quite useful in those areas too.</p><p><br></p><p>In the context of environmental sciences, we analyzed models for climate systems [&nbsp;EJ-23&nbsp;] (also proceedings [&nbsp;EP-3&nbsp;]). Climate belongs to the class of systems whose dynamics are only observable in transient states and the resulting mathematical models are characterized by the fact that small-scale phenomena influence the large-scale properties of the modelling system (with the former that cannot be extracted from the latter using available hardware and computational procedures). We provided arguments for such models to be treated as a link between coupled physical processes and computational decoupling with subsequent implications to further climate predictions.</p><p><br></p><p>Our contributions to the development of mathematical models for renewable and alternative sources of energy are described&nbsp;here.</p><p>We are interested in the development of mathematical models for biological and chemical sensors (including those can be used in harsh environments for environmental monitoring), as well as for the field emission as an alternative to the conventional X-ray radiation. In particular, we proposed a series of new multiscale multi-physics models for the evolution of Carbon Nanotubes (CNTs) on thin films, numerical methods for the solution of the resulting problems, and we reported the efficiency of the proposed models and techniques based on theoretical, computational, and experimental results [&nbsp;EJ-112&nbsp;,&nbsp;EJ-116&nbsp;,&nbsp;EJ-122&nbsp;,&nbsp;EJ-131&nbsp;].</p><p><br></p><p>We developed mathematical models and efficient numerical methods for their solutions for studying the effect of thermal damage induced by ultrashort pulsed lasers [&nbsp;EJ-89&nbsp;,&nbsp;EJ-96&nbsp;,&nbsp;EJ-119&nbsp;]. Apart from applications in physics, chemistry, and engineering, this research is increasingly important in biology and medicine in the context of preventing thermal damage of human tissues.</p><p><br></p><p>Piezoeffect in biological tissues has been a subject of long standing interest and controversies. We analyzed this effect in a dynamic setting accounting for the hydration effect in human cornea [&nbsp;EJ-99&nbsp;]. Other problems of piezoelectricity, including the issues of existence, uniqueness, and regularity of solutions for the corresponding time-dependent mathematical models can be found&nbsp;here.</p><p><br></p><p>Several models for the analysis of relaxation of DNA molecules were proposed in [&nbsp;EJ-105&nbsp;,&nbsp;EJ-109&nbsp;] and more information about our research in these areas can be found&nbsp;here. These include also RNA silencing phenomena [&nbsp;EP-67&nbsp;], modelling genetic networks as a multiscale process [&nbsp;EP-37&nbsp;], and the analysis of cell cycle dynamics [&nbsp;EJ -130&nbsp;].</p><p>&nbsp;</p>",
                "pIndex": "3",
                "keywords": "",
                "project": 27,
                "created_at": "2020-07-13T05:20:33.293Z",
                "updated_at": "2020-11-11T02:56:31.685Z",
                "publications": [
                    106,
                    283,
                    244,
                    118,
                    219,
                    109,
                    97,
                    235,
                    122,
                    131,
                    239,
                    102,
                    277,
                    295,
                    110,
                    303,
                    115,
                    101,
                    181,
                    217,
                    299,
                    117,
                    132,
                    147,
                    138,
                    306,
                    337,
                    103,
                    98,
                    255,
                    112,
                    143,
                    126,
                    225,
                    104,
                    288,
                    300,
                    246,
                    199,
                    268,
                    222
                ]
            }
        ]
    }
]